-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1:3306
-- Généré le :  mar. 10 déc. 2019 à 19:34
-- Version du serveur :  5.7.24
-- Version de PHP :  7.2.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données :  `bd_colis_esic`
--

-- --------------------------------------------------------

--
-- Structure de la table `alerte`
--

DROP TABLE IF EXISTS `alerte`;
CREATE TABLE IF NOT EXISTS `alerte` (
  `id_alerte` int(11) NOT NULL AUTO_INCREMENT,
  `id_utilisateur` int(11) DEFAULT NULL,
  `ville_depart` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `ville_arrivee` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `date_depot` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Date de depot de l''alerte',
  PRIMARY KEY (`id_alerte`),
  KEY `FK_USER_DEPOSE_ALERTE` (`id_utilisateur`)
) ENGINE=InnoDB AUTO_INCREMENT=117 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `alerte`
--

INSERT INTO `alerte` (`id_alerte`, `id_utilisateur`, `ville_depart`, `ville_arrivee`, `date_depot`) VALUES
(18, NULL, 'Saint-Jacques Landes-France', 'Rouen-France', '2018-08-25 09:37:49'),
(37, 6, 'Johannesbourg-Afrique du Sud', 'Abidjan-Cote d\'ivoire', '2017-07-07 10:21:16'),
(38, 5, 'Lille-France', 'Douala-Cameroun', '2017-07-07 10:21:16'),
(39, 39, 'Bruxelles-Belgique', 'Montreal-CANADA', '2017-07-07 10:21:16'),
(47, 6, 'Paris-France', 'Rennes-France', '2018-02-06 20:07:56'),
(48, NULL, 'Lille-France', 'Douala-Cameroun', '2018-02-06 20:07:57'),
(49, 6, 'Paris-France', 'Rennes-France', '2018-02-07 04:04:22'),
(50, NULL, 'Lille-France', 'Douala-Cameroun', '2018-02-07 04:04:23'),
(56, 39, 'Gurundi', 'Londou', '2018-02-19 20:20:59'),
(57, 6, 'Croix Lille, France', 'Douala, Littoral2, Cameroun', '2018-02-21 13:35:12'),
(58, 6, 'Yaounde, Centre, Cameroun', 'Le mans,France', '2018-02-21 13:57:53'),
(59, 6, 'Croix Lille, France', 'Loum,Littoral,Cameroun', '2018-02-21 16:20:14'),
(60, 6, 'Yaounde, Centre, Cameroun', 'Le mans,France', '2018-02-21 16:20:30'),
(61, 6, 'Yaounde, Centre, Cameroun', 'Loum,Littoral,Cameroun', '2018-02-21 16:28:58'),
(62, 6, 'Yaounde, Centre, Cameroun', 'Douala, Littoral2, Cameroun', '2018-02-21 16:29:08'),
(63, 6, 'Yaounde, Centre, Cameroun', 'Le mans,France', '2018-02-21 16:49:09'),
(64, 6, 'Croix Lille, France', 'Le mans,France', '2018-02-21 16:50:15'),
(65, 6, 'Croix Lille, France', 'Douala2, Littoral, Cameroun', '2018-02-21 16:51:25'),
(68, 6, 'Croix Lille, France', 'Le mans,France', '2018-02-22 15:58:45'),
(69, 39, 'Yaounde, Centre, Cameroun', 'Douala2, Littoral, Cameroun', '2018-02-22 15:59:22'),
(70, 6, 'Yaounde, Centre, Cameroun', 'Douala2, Littoral, Cameroun', '2018-02-22 16:00:55'),
(71, 6, 'Yaounde, Centre, Cameroun', 'edea,Cameroun', '2018-02-22 16:01:21'),
(72, NULL, 'Johannesbourg, Afrique du Sud', 'Libreville, Gabon via PostMan', '2018-02-22 21:32:16'),
(73, NULL, 'Johannesbourg, Afrique du Sud', 'Libreville, Gabon via PostMan', '2018-02-22 21:44:57'),
(92, NULL, 'Babadjou-Cameroun', 'Montmagny-France', '2018-08-25 09:25:43'),
(99, NULL, 'Chasnès-sur-illet-France', 'Addis-Abeba-Ethiopie', '2019-03-07 00:23:27'),
(100, 50, 'Charleroi-Belgique', 'Montreal-CANADA', '2019-03-12 10:48:26'),
(101, 39, 'Bruxelles-Belgique', 'Montreal-CANADA', '2019-03-10 12:35:00'),
(102, 6, 'Johannesbourg-Afrique du Sud', 'Abidjan-Cote d\'ivoire', '2019-03-11 05:05:58'),
(103, 39, 'Bruxelles-Belgique', 'Montreal-CANADA', '2019-03-11 05:05:58'),
(104, 6, 'Johannesbourg-Afrique du Sud', 'Abidjan-Cote d\'ivoire', '2019-03-12 10:15:58'),
(105, 39, 'Bruxelles-Belgique', 'Montreal-CANADA', '2019-03-12 10:15:58'),
(106, 49, 'Mbouda-Cameroun', 'Turin-Italie', '2019-03-12 10:15:58'),
(107, 6, 'Johannesbourg-Afrique du Sud', 'Abidjan-Cote d\'ivoire', '2019-03-12 10:48:26'),
(108, 39, 'Bruxelles-Belgique', 'Montreal-CANADA', '2019-03-12 10:48:26'),
(109, 49, 'Mbouda-Cameroun', 'Turin-Italie', '2019-03-12 10:48:26'),
(111, 39, 'Montauban,France', 'Orleans,France', '2019-06-30 07:48:55'),
(112, 39, 'Montauban,France', 'Orleans,France', '2019-06-30 07:49:31'),
(113, NULL, 'Montauban,France', 'Orleans,France', '2019-06-30 08:09:09'),
(114, 39, 'Montauban,France', 'Orleans,France', '2019-06-30 09:16:29'),
(115, NULL, 'Montauban,France', 'Orleans,France', '2019-06-30 09:16:29'),
(116, NULL, 'Montauban,France', 'Orleans,France', '2019-06-30 09:16:30');

-- --------------------------------------------------------

--
-- Structure de la table `annonce`
--

DROP TABLE IF EXISTS `annonce`;
CREATE TABLE IF NOT EXISTS `annonce` (
  `id_annonce` int(11) NOT NULL AUTO_INCREMENT,
  `id_utilisateur` int(11) NOT NULL,
  `nature_colis` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `poids` decimal(10,0) NOT NULL,
  `unite_poids` int(11) NOT NULL,
  `date_depot` datetime NOT NULL,
  `date_depart` datetime NOT NULL,
  `date_arrivee` datetime NOT NULL,
  `ville_depart` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `ville_arrivee` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `prime` decimal(10,0) NOT NULL,
  `devise` int(11) NOT NULL,
  `statut` varchar(10) COLLATE utf8_unicode_ci DEFAULT NULL,
  `type_annonce` int(11) NOT NULL DEFAULT '1',
  `detail` varchar(250) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id_annonce`),
  KEY `FK_USER_DEPOSE_ANNONCE` (`id_utilisateur`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `annonce`
--

INSERT INTO `annonce` (`id_annonce`, `id_utilisateur`, `nature_colis`, `poids`, `unite_poids`, `date_depot`, `date_depart`, `date_arrivee`, `ville_depart`, `ville_arrivee`, `prime`, `devise`, `statut`, `type_annonce`, `detail`) VALUES
(2, 3, '2', '34', 2, '2015-07-01 15:14:41', '2015-07-16 00:00:00', '2015-07-26 00:00:00', 'Paris, France', 'Bamako, Mali', '456', 2, '1', 2, 'nkdnkazndÃ¹knazdknakdnaÃ¹ldknaldkbjÃ©ubÃ©d bdiab zhdoihzado jdizjz'),
(3, 6, '2', '12', 1, '2015-07-29 15:38:54', '2015-05-12 00:00:00', '2015-04-10 00:00:00', 'Paris, France', 'Douala, Littoral, Cameroun', '45', 1, '1', 2, 'Je propose de vous le ramener'),
(4, 5, '2', '35', 2, '2017-06-24 15:38:54', '2017-09-24 15:38:54', '2017-10-10 10:38:54', 'Lyon, France', 'Abidjan,Cote d\'ivoire', '200', 1, '1', 2, 'Un objet d\'une valeur sentimentale a transporter'),
(5, 6, '2', '23', 1, '2017-07-06 07:38:54', '2017-07-31 00:00:00', '2017-08-01 00:00:00', 'Londres, Angleterre', 'Johannesbourg, Afrique du sud', '340', 1, '1', 2, 'Sans commentaire');

-- --------------------------------------------------------

--
-- Structure de la table `batch_job_execution`
--

DROP TABLE IF EXISTS `batch_job_execution`;
CREATE TABLE IF NOT EXISTS `batch_job_execution` (
  `JOB_EXECUTION_ID` bigint(20) NOT NULL,
  `VERSION` bigint(20) DEFAULT NULL,
  `JOB_INSTANCE_ID` bigint(20) NOT NULL,
  `CREATE_TIME` datetime NOT NULL,
  `START_TIME` datetime DEFAULT NULL,
  `END_TIME` datetime DEFAULT NULL,
  `STATUS` varchar(10) DEFAULT NULL,
  `EXIT_CODE` varchar(2500) DEFAULT NULL,
  `EXIT_MESSAGE` varchar(2500) DEFAULT NULL,
  `LAST_UPDATED` datetime DEFAULT NULL,
  `JOB_CONFIGURATION_LOCATION` varchar(2500) DEFAULT NULL,
  PRIMARY KEY (`JOB_EXECUTION_ID`),
  KEY `JOB_INST_EXEC_FK` (`JOB_INSTANCE_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_job_execution`
--

INSERT INTO `batch_job_execution` (`JOB_EXECUTION_ID`, `VERSION`, `JOB_INSTANCE_ID`, `CREATE_TIME`, `START_TIME`, `END_TIME`, `STATUS`, `EXIT_CODE`, `EXIT_MESSAGE`, `LAST_UPDATED`, `JOB_CONFIGURATION_LOCATION`) VALUES
(1, 2, 1, '2017-07-02 00:11:21', '2017-07-02 00:11:21', '2017-07-02 00:11:21', 'COMPLETED', 'COMPLETED', '', '2017-07-02 00:11:21', NULL),
(2, 2, 2, '2017-07-02 08:54:52', '2017-07-02 08:54:52', '2017-07-02 08:54:52', 'COMPLETED', 'COMPLETED', '', '2017-07-02 08:54:52', NULL),
(3, 2, 3, '2017-07-02 08:59:09', '2017-07-02 08:59:09', '2017-07-02 08:59:09', 'COMPLETED', 'COMPLETED', '', '2017-07-02 08:59:09', NULL),
(4, 2, 4, '2017-07-02 09:01:23', '2017-07-02 09:01:23', '2017-07-02 09:01:23', 'COMPLETED', 'COMPLETED', '', '2017-07-02 09:01:23', NULL),
(5, 2, 5, '2017-07-02 09:51:10', '2017-07-02 09:51:10', '2017-07-02 09:51:10', 'COMPLETED', 'COMPLETED', '', '2017-07-02 09:51:10', NULL),
(6, 2, 6, '2017-07-02 11:09:45', '2017-07-02 11:09:45', '2017-07-02 11:09:46', 'COMPLETED', 'COMPLETED', '', '2017-07-02 11:09:46', NULL),
(7, 2, 7, '2017-07-02 11:09:46', '2017-07-02 11:09:46', '2017-07-02 11:09:46', 'COMPLETED', 'COMPLETED', '', '2017-07-02 11:09:46', NULL),
(8, 2, 8, '2017-07-02 11:11:51', '2017-07-02 11:11:51', '2017-07-02 11:11:51', 'COMPLETED', 'COMPLETED', '', '2017-07-02 11:11:51', NULL),
(9, 2, 9, '2017-07-02 11:11:51', '2017-07-02 11:11:51', '2017-07-02 11:11:51', 'COMPLETED', 'COMPLETED', '', '2017-07-02 11:11:51', NULL),
(10, 2, 10, '2017-07-02 11:14:45', '2017-07-02 11:14:45', '2017-07-02 11:14:46', 'FAILED', 'FAILED', '', '2017-07-02 11:14:46', NULL),
(11, 2, 10, '2017-07-02 11:15:47', '2017-07-02 11:15:47', '2017-07-02 11:15:47', 'FAILED', 'FAILED', '', '2017-07-02 11:15:47', NULL),
(12, 2, 10, '2017-07-02 11:16:01', '2017-07-02 11:16:01', '2017-07-02 11:16:01', 'FAILED', 'FAILED', '', '2017-07-02 11:16:01', NULL),
(13, 2, 10, '2017-07-02 11:16:15', '2017-07-02 11:16:15', '2017-07-02 11:16:15', 'FAILED', 'FAILED', '', '2017-07-02 11:16:15', NULL),
(14, 2, 10, '2017-07-02 11:17:04', '2017-07-02 11:17:04', '2017-07-02 11:17:04', 'FAILED', 'FAILED', '', '2017-07-02 11:17:04', NULL),
(15, 2, 10, '2017-07-02 11:21:22', '2017-07-02 11:21:22', '2017-07-02 11:21:22', 'FAILED', 'FAILED', '', '2017-07-02 11:21:22', NULL),
(16, 2, 10, '2017-07-02 11:21:54', '2017-07-02 11:21:54', '2017-07-02 11:21:54', 'FAILED', 'FAILED', '', '2017-07-02 11:21:54', NULL),
(17, 2, 10, '2017-07-02 11:24:20', '2017-07-02 11:24:20', '2017-07-02 11:24:20', 'FAILED', 'FAILED', '', '2017-07-02 11:24:20', NULL),
(18, 2, 10, '2017-07-02 11:24:46', '2017-07-02 11:24:46', '2017-07-02 11:24:46', 'FAILED', 'FAILED', '', '2017-07-02 11:24:46', NULL),
(19, 2, 10, '2017-07-02 11:25:04', '2017-07-02 11:25:04', '2017-07-02 11:25:04', 'FAILED', 'FAILED', '', '2017-07-02 11:25:04', NULL),
(20, 2, 10, '2017-07-02 11:25:32', '2017-07-02 11:25:32', '2017-07-02 11:25:32', 'FAILED', 'FAILED', '', '2017-07-02 11:25:32', NULL),
(21, 2, 10, '2017-07-02 11:26:12', '2017-07-02 11:26:12', '2017-07-02 11:26:13', 'FAILED', 'FAILED', '', '2017-07-02 11:26:13', NULL),
(22, 2, 10, '2017-07-02 16:46:05', '2017-07-02 16:46:05', '2017-07-02 16:46:06', 'FAILED', 'FAILED', '', '2017-07-02 16:46:06', NULL),
(23, 2, 10, '2017-07-02 16:47:09', '2017-07-02 16:47:09', '2017-07-02 16:47:09', 'FAILED', 'FAILED', '', '2017-07-02 16:47:09', NULL),
(24, 2, 10, '2017-07-02 16:50:09', '2017-07-02 16:50:09', '2017-07-02 16:50:09', 'FAILED', 'FAILED', '', '2017-07-02 16:50:09', NULL),
(25, 2, 10, '2017-07-02 16:51:27', '2017-07-02 16:51:27', '2017-07-02 16:51:27', 'FAILED', 'FAILED', '', '2017-07-02 16:51:27', NULL),
(26, 2, 10, '2017-07-02 16:52:01', '2017-07-02 16:52:01', '2017-07-02 16:52:01', 'COMPLETED', 'COMPLETED', '', '2017-07-02 16:52:01', NULL),
(27, 2, 11, '2017-07-02 16:55:32', '2017-07-02 16:55:32', '2017-07-02 16:55:32', 'COMPLETED', 'COMPLETED', '', '2017-07-02 16:55:32', NULL),
(28, 2, 12, '2017-07-02 17:44:28', '2017-07-02 17:44:28', '2017-07-02 17:44:28', 'COMPLETED', 'COMPLETED', '', '2017-07-02 17:44:28', NULL),
(29, 2, 13, '2017-07-02 17:45:24', '2017-07-02 17:45:24', '2017-07-02 17:45:24', 'COMPLETED', 'COMPLETED', '', '2017-07-02 17:45:24', NULL),
(30, 2, 14, '2017-07-02 17:47:29', '2017-07-02 17:47:29', '2017-07-02 17:47:29', 'COMPLETED', 'COMPLETED', '', '2017-07-02 17:47:29', NULL),
(31, 2, 15, '2017-07-03 23:11:54', '2017-07-03 23:11:54', '2017-07-03 23:11:54', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:11:54', NULL),
(32, 2, 16, '2017-07-03 23:11:54', '2017-07-03 23:11:54', '2017-07-03 23:11:55', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:11:55', NULL),
(33, 2, 17, '2017-07-03 23:12:44', '2017-07-03 23:12:44', '2017-07-03 23:12:44', 'FAILED', 'FAILED', '', '2017-07-03 23:12:44', NULL),
(34, 2, 17, '2017-07-03 23:37:25', '2017-07-03 23:37:25', '2017-07-03 23:37:25', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:37:25', NULL),
(35, 2, 18, '2017-07-03 23:38:32', '2017-07-03 23:38:32', '2017-07-03 23:38:32', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:38:32', NULL),
(36, 2, 19, '2017-07-03 23:39:36', '2017-07-03 23:39:36', '2017-07-03 23:39:36', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:39:36', NULL),
(37, 2, 20, '2017-07-03 23:40:01', '2017-07-03 23:40:01', '2017-07-03 23:40:02', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:40:02', NULL),
(38, 2, 21, '2017-07-03 23:44:43', '2017-07-03 23:44:43', '2017-07-03 23:44:44', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:44:44', NULL),
(39, 2, 22, '2017-07-03 23:45:25', '2017-07-03 23:45:25', '2017-07-03 23:45:25', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:45:25', NULL),
(40, 2, 23, '2017-07-03 23:45:47', '2017-07-03 23:45:47', '2017-07-03 23:45:47', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:45:47', NULL),
(41, 2, 24, '2017-07-03 23:46:20', '2017-07-03 23:46:20', '2017-07-03 23:46:20', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:46:20', NULL),
(42, 2, 25, '2017-07-03 23:46:35', '2017-07-03 23:46:35', '2017-07-03 23:46:35', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:46:35', NULL),
(43, 2, 26, '2017-07-03 23:52:43', '2017-07-03 23:52:43', '2017-07-03 23:52:43', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:52:43', NULL),
(44, 1, 27, '2017-07-03 23:54:05', '2017-07-03 23:54:05', NULL, 'STARTED', 'UNKNOWN', '', '2017-07-03 23:54:05', NULL),
(45, 1, 28, '2017-07-03 23:56:30', '2017-07-03 23:56:30', NULL, 'STARTED', 'UNKNOWN', '', '2017-07-03 23:56:30', NULL),
(46, 1, 29, '2017-07-03 23:57:04', '2017-07-03 23:57:04', NULL, 'STARTED', 'UNKNOWN', '', '2017-07-03 23:57:04', NULL),
(47, 2, 30, '2017-07-03 23:58:27', '2017-07-03 23:58:27', '2017-07-03 23:58:28', 'COMPLETED', 'COMPLETED', '', '2017-07-03 23:58:28', NULL),
(48, 2, 31, '2017-07-04 07:15:50', '2017-07-04 07:15:50', '2017-07-04 07:15:51', 'COMPLETED', 'COMPLETED', '', '2017-07-04 07:15:51', NULL),
(49, 2, 32, '2017-07-04 07:21:16', '2017-07-04 07:21:16', '2017-07-04 07:21:16', 'COMPLETED', 'COMPLETED', '', '2017-07-04 07:21:16', NULL),
(50, 2, 33, '2017-07-04 20:57:54', '2017-07-04 20:57:54', '2017-07-04 20:57:54', 'COMPLETED', 'COMPLETED', '', '2017-07-04 20:57:54', NULL),
(51, 2, 34, '2017-07-04 20:59:48', '2017-07-04 20:59:48', '2017-07-04 20:59:48', 'COMPLETED', 'COMPLETED', '', '2017-07-04 20:59:48', NULL),
(52, 2, 35, '2017-07-04 21:21:32', '2017-07-04 21:21:32', '2017-07-04 21:21:32', 'COMPLETED', 'COMPLETED', '', '2017-07-04 21:21:32', NULL),
(53, 2, 36, '2017-07-04 21:21:49', '2017-07-04 21:21:49', '2017-07-04 21:21:49', 'COMPLETED', 'COMPLETED', '', '2017-07-04 21:21:49', NULL),
(54, 2, 37, '2017-07-07 10:45:19', '2017-07-07 10:45:19', '2017-07-07 10:45:19', 'COMPLETED', 'COMPLETED', '', '2017-07-07 10:45:19', NULL),
(55, 2, 38, '2017-07-07 10:45:43', '2017-07-07 10:45:43', '2017-07-07 10:45:43', 'COMPLETED', 'COMPLETED', '', '2017-07-07 10:45:43', NULL),
(56, 2, 39, '2017-07-07 11:36:30', '2017-07-07 11:36:30', '2017-07-07 11:36:30', 'COMPLETED', 'COMPLETED', '', '2017-07-07 11:36:30', NULL),
(57, 2, 40, '2017-07-07 11:41:35', '2017-07-07 11:41:35', '2017-07-07 11:41:35', 'COMPLETED', 'COMPLETED', '', '2017-07-07 11:41:35', NULL),
(58, 2, 41, '2017-07-07 13:33:03', '2017-07-07 13:33:03', '2017-07-07 13:33:03', 'FAILED', 'FAILED', '', '2017-07-07 13:33:03', NULL),
(59, 2, 42, '2017-07-07 13:33:59', '2017-07-07 13:33:59', '2017-07-07 13:33:59', 'COMPLETED', 'COMPLETED', '', '2017-07-07 13:33:59', NULL),
(60, 2, 43, '2017-07-07 13:41:20', '2017-07-07 13:41:20', '2017-07-07 13:41:20', 'FAILED', 'FAILED', '', '2017-07-07 13:41:20', NULL),
(61, 2, 44, '2017-07-07 13:41:50', '2017-07-07 13:41:50', '2017-07-07 13:41:50', 'COMPLETED', 'COMPLETED', '', '2017-07-07 13:41:50', NULL),
(62, 2, 45, '2017-07-07 13:43:16', '2017-07-07 13:43:16', '2017-07-07 13:43:16', 'FAILED', 'FAILED', '', '2017-07-07 13:43:16', NULL),
(63, 2, 46, '2017-07-07 13:44:08', '2017-07-07 13:44:08', '2017-07-07 13:44:09', 'COMPLETED', 'COMPLETED', '', '2017-07-07 13:44:09', NULL),
(64, 2, 47, '2017-07-07 14:09:42', '2017-07-07 14:09:43', '2017-07-07 14:09:43', 'FAILED', 'FAILED', '', '2017-07-07 14:09:43', NULL),
(65, 2, 48, '2017-07-07 14:20:03', '2017-07-07 14:20:03', '2017-07-07 14:20:03', 'FAILED', 'FAILED', '', '2017-07-07 14:20:03', NULL),
(66, 2, 49, '2017-07-07 14:20:44', '2017-07-07 14:20:44', '2017-07-07 14:20:44', 'FAILED', 'FAILED', '', '2017-07-07 14:20:44', NULL),
(67, 2, 50, '2017-07-07 14:21:15', '2017-07-07 14:21:15', '2017-07-07 14:21:16', 'COMPLETED', 'COMPLETED', '', '2017-07-07 14:21:16', NULL),
(68, 2, 51, '2017-07-07 14:22:14', '2017-07-07 14:22:14', '2017-07-07 14:22:14', 'FAILED', 'FAILED', '', '2017-07-07 14:22:14', NULL),
(69, 2, 52, '2017-07-07 14:22:34', '2017-07-07 14:22:34', '2017-07-07 14:22:34', 'COMPLETED', 'COMPLETED', '', '2017-07-07 14:22:34', NULL),
(70, 2, 53, '2017-12-10 11:26:03', '2017-12-10 11:26:03', '2017-12-10 11:26:03', 'COMPLETED', 'COMPLETED', '', '2017-12-10 11:26:03', NULL),
(71, 2, 54, '2019-03-10 14:35:00', '2019-03-10 14:35:00', '2019-03-10 14:35:00', 'COMPLETED', 'COMPLETED', '', '2019-03-10 14:35:00', NULL),
(72, 2, 55, '2019-03-11 07:05:58', '2019-03-11 07:05:58', '2019-03-11 07:05:58', 'COMPLETED', 'COMPLETED', '', '2019-03-11 07:05:58', NULL),
(73, 2, 56, '2019-03-11 07:11:06', '2019-03-11 07:11:06', '2019-03-11 07:11:07', 'FAILED', 'FAILED', '', '2019-03-11 07:11:07', NULL),
(74, 2, 56, '2019-03-11 07:13:02', '2019-03-11 07:13:02', '2019-03-11 07:13:02', 'COMPLETED', 'COMPLETED', '', '2019-03-11 07:13:02', NULL),
(75, 1, 57, '2019-03-11 07:14:43', '2019-03-11 07:14:43', NULL, 'STARTED', 'UNKNOWN', '', '2019-03-11 07:14:43', NULL),
(76, 2, 58, '2019-03-11 07:15:57', '2019-03-11 07:15:57', '2019-03-11 07:15:57', 'COMPLETED', 'COMPLETED', '', '2019-03-11 07:15:57', NULL),
(77, 2, 59, '2019-03-12 12:15:58', '2019-03-12 12:15:58', '2019-03-12 12:15:58', 'COMPLETED', 'COMPLETED', '', '2019-03-12 12:15:58', NULL),
(78, 2, 60, '2019-03-12 12:48:26', '2019-03-12 12:48:26', '2019-03-12 12:48:26', 'COMPLETED', 'COMPLETED', '', '2019-03-12 12:48:26', NULL),
(79, 2, 61, '2019-03-21 22:13:22', '2019-03-21 22:13:22', '2019-03-21 22:13:22', 'COMPLETED', 'COMPLETED', '', '2019-03-21 22:13:22', NULL),
(80, 2, 62, '2019-03-21 23:13:27', '2019-03-21 23:13:27', '2019-03-21 23:13:27', 'FAILED', 'FAILED', '', '2019-03-21 23:13:27', NULL),
(81, 2, 62, '2019-03-21 23:14:38', '2019-03-21 23:14:38', '2019-03-21 23:14:39', 'COMPLETED', 'COMPLETED', '', '2019-03-21 23:14:39', NULL),
(82, 2, 63, '2019-03-23 22:43:20', '2019-03-23 22:43:20', '2019-03-23 22:43:21', 'COMPLETED', 'COMPLETED', '', '2019-03-23 22:43:21', NULL),
(83, 2, 64, '2019-03-24 12:06:41', '2019-03-24 12:06:41', '2019-03-24 12:06:41', 'COMPLETED', 'COMPLETED', '', '2019-03-24 12:06:41', NULL),
(84, 2, 65, '2019-03-24 12:06:41', '2019-03-24 12:06:41', '2019-03-24 12:06:42', 'COMPLETED', 'COMPLETED', '', '2019-03-24 12:06:42', NULL),
(85, 2, 66, '2019-03-24 12:10:20', '2019-03-24 12:10:20', '2019-03-24 12:10:21', 'COMPLETED', 'COMPLETED', '', '2019-03-24 12:10:21', NULL),
(86, 2, 67, '2019-03-24 12:10:21', '2019-03-24 12:10:21', '2019-03-24 12:10:21', 'COMPLETED', 'COMPLETED', '', '2019-03-24 12:10:21', NULL),
(87, 2, 68, '2019-03-24 12:12:49', '2019-03-24 12:12:49', '2019-03-24 12:12:49', 'COMPLETED', 'COMPLETED', '', '2019-03-24 12:12:49', NULL),
(88, 2, 69, '2019-03-24 13:05:30', '2019-03-24 13:05:30', '2019-03-24 13:05:31', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:05:31', NULL),
(89, 2, 70, '2019-03-24 13:05:31', '2019-03-24 13:05:31', '2019-03-24 13:05:31', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:05:31', NULL),
(90, 2, 71, '2019-03-24 13:11:45', '2019-03-24 13:11:45', '2019-03-24 13:11:45', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:11:45', NULL),
(91, 2, 72, '2019-03-24 13:12:15', '2019-03-24 13:12:15', '2019-03-24 13:12:15', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:12:15', NULL),
(92, 2, 73, '2019-03-24 13:14:51', '2019-03-24 13:14:51', '2019-03-24 13:14:51', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:14:51', NULL),
(93, 2, 74, '2019-03-24 13:15:47', '2019-03-24 13:15:47', '2019-03-24 13:15:47', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:15:47', NULL),
(94, 2, 75, '2019-03-24 13:16:04', '2019-03-24 13:16:04', '2019-03-24 13:16:05', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:16:05', NULL),
(95, 2, 76, '2019-03-24 13:16:12', '2019-03-24 13:16:12', '2019-03-24 13:16:12', 'COMPLETED', 'COMPLETED', '', '2019-03-24 13:16:12', NULL),
(96, 2, 77, '2019-03-24 14:28:47', '2019-03-24 14:28:47', '2019-03-24 14:28:47', 'COMPLETED', 'COMPLETED', '', '2019-03-24 14:28:47', NULL),
(97, 2, 78, '2019-03-24 14:29:44', '2019-03-24 14:29:44', '2019-03-24 14:29:44', 'COMPLETED', 'COMPLETED', '', '2019-03-24 14:29:44', NULL),
(98, 2, 79, '2019-03-24 15:25:36', '2019-03-24 15:25:36', '2019-03-24 15:25:37', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:25:37', NULL),
(99, 2, 80, '2019-03-24 15:44:08', '2019-03-24 15:44:08', '2019-03-24 15:44:09', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:44:09', NULL),
(100, 2, 81, '2019-03-24 15:45:13', '2019-03-24 15:45:14', '2019-03-24 15:45:14', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:45:14', NULL),
(101, 2, 82, '2019-03-24 15:50:09', '2019-03-24 15:50:09', '2019-03-24 15:50:09', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:50:09', NULL),
(102, 2, 83, '2019-03-24 15:51:23', '2019-03-24 15:51:23', '2019-03-24 15:51:23', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:51:23', NULL),
(103, 2, 84, '2019-03-24 15:53:43', '2019-03-24 15:53:43', '2019-03-24 15:53:43', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:53:43', NULL),
(104, 2, 85, '2019-03-24 15:55:50', '2019-03-24 15:55:50', '2019-03-24 15:55:51', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:55:51', NULL),
(105, 2, 86, '2019-03-24 15:56:21', '2019-03-24 15:56:21', '2019-03-24 15:56:22', 'COMPLETED', 'COMPLETED', '', '2019-03-24 15:56:22', NULL),
(106, 2, 87, '2019-03-24 16:00:18', '2019-03-24 16:00:18', '2019-03-24 16:00:19', 'COMPLETED', 'COMPLETED', '', '2019-03-24 16:00:19', NULL),
(107, 2, 88, '2019-03-24 16:02:52', '2019-03-24 16:02:52', '2019-03-24 16:02:53', 'COMPLETED', 'COMPLETED', '', '2019-03-24 16:02:53', NULL),
(108, 2, 89, '2019-03-24 16:04:27', '2019-03-24 16:04:27', '2019-03-24 16:04:28', 'COMPLETED', 'COMPLETED', '', '2019-03-24 16:04:28', NULL),
(109, 2, 90, '2019-03-24 16:06:04', '2019-03-24 16:06:04', '2019-03-24 16:06:05', 'COMPLETED', 'COMPLETED', '', '2019-03-24 16:06:05', NULL),
(110, 2, 91, '2019-03-24 16:12:02', '2019-03-24 16:12:02', '2019-03-24 16:12:02', 'FAILED', 'FAILED', '', '2019-03-24 16:12:02', NULL),
(111, 2, 92, '2019-03-24 16:13:13', '2019-03-24 16:13:13', '2019-03-24 16:13:14', 'COMPLETED', 'COMPLETED', '', '2019-03-24 16:13:14', NULL),
(112, 2, 93, '2019-03-24 16:16:30', '2019-03-24 16:16:30', '2019-03-24 16:16:30', 'COMPLETED', 'COMPLETED', '', '2019-03-24 16:16:30', NULL),
(113, 2, 94, '2019-03-24 17:35:55', '2019-03-24 17:35:55', '2019-03-24 17:35:56', 'COMPLETED', 'COMPLETED', '', '2019-03-24 17:35:56', NULL),
(114, 2, 95, '2019-03-24 17:47:33', '2019-03-24 17:47:33', '2019-03-24 17:47:33', 'FAILED', 'FAILED', '', '2019-03-24 17:47:33', NULL),
(115, 2, 96, '2019-03-24 17:49:49', '2019-03-24 17:49:49', '2019-03-24 17:49:49', 'COMPLETED', 'COMPLETED', '', '2019-03-24 17:49:49', NULL),
(116, 2, 97, '2019-03-25 07:38:07', '2019-03-25 07:38:07', '2019-03-25 07:38:08', 'FAILED', 'FAILED', '', '2019-03-25 07:38:08', NULL),
(117, 2, 98, '2019-03-25 07:51:29', '2019-03-25 07:51:29', '2019-03-25 07:51:30', 'COMPLETED', 'COMPLETED', '', '2019-03-25 07:51:30', NULL),
(118, 2, 99, '2019-03-25 07:53:42', '2019-03-25 07:53:42', '2019-03-25 07:53:43', 'COMPLETED', 'COMPLETED', '', '2019-03-25 07:53:43', NULL),
(119, 2, 100, '2019-03-25 07:54:16', '2019-03-25 07:54:16', '2019-03-25 07:54:17', 'COMPLETED', 'COMPLETED', '', '2019-03-25 07:54:17', NULL),
(120, 2, 101, '2019-03-25 21:57:06', '2019-03-25 21:57:06', '2019-03-25 21:57:06', 'COMPLETED', 'COMPLETED', '', '2019-03-25 21:57:06', NULL),
(121, 2, 102, '2019-03-25 22:04:24', '2019-03-25 22:04:24', '2019-03-25 22:04:24', 'COMPLETED', 'COMPLETED', '', '2019-03-25 22:04:24', NULL);

-- --------------------------------------------------------

--
-- Structure de la table `batch_job_execution_context`
--

DROP TABLE IF EXISTS `batch_job_execution_context`;
CREATE TABLE IF NOT EXISTS `batch_job_execution_context` (
  `JOB_EXECUTION_ID` bigint(20) NOT NULL,
  `SHORT_CONTEXT` varchar(2500) NOT NULL,
  `SERIALIZED_CONTEXT` text,
  PRIMARY KEY (`JOB_EXECUTION_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_job_execution_context`
--

INSERT INTO `batch_job_execution_context` (`JOB_EXECUTION_ID`, `SHORT_CONTEXT`, `SERIALIZED_CONTEXT`) VALUES
(1, '{\"map\":[\"\"]}', NULL),
(2, '{\"map\":[\"\"]}', NULL),
(3, '{\"map\":[\"\"]}', NULL),
(4, '{\"map\":[\"\"]}', NULL),
(5, '{\"map\":[\"\"]}', NULL),
(6, '{\"map\":[\"\"]}', NULL),
(7, '{\"map\":[\"\"]}', NULL),
(8, '{\"map\":[\"\"]}', NULL),
(9, '{\"map\":[\"\"]}', NULL),
(10, '{\"map\":[\"\"]}', NULL),
(11, '{\"map\":[\"\"]}', NULL),
(12, '{\"map\":[\"\"]}', NULL),
(13, '{\"map\":[\"\"]}', NULL),
(14, '{\"map\":[\"\"]}', NULL),
(15, '{\"map\":[\"\"]}', NULL),
(16, '{\"map\":[\"\"]}', NULL),
(17, '{\"map\":[\"\"]}', NULL),
(18, '{\"map\":[\"\"]}', NULL),
(19, '{\"map\":[\"\"]}', NULL),
(20, '{\"map\":[\"\"]}', NULL),
(21, '{\"map\":[\"\"]}', NULL),
(22, '{\"map\":[\"\"]}', NULL),
(23, '{\"map\":[\"\"]}', NULL),
(24, '{\"map\":[\"\"]}', NULL),
(25, '{\"map\":[\"\"]}', NULL),
(26, '{\"map\":[\"\"]}', NULL),
(27, '{\"map\":[\"\"]}', NULL),
(28, '{\"map\":[\"\"]}', NULL),
(29, '{\"map\":[\"\"]}', NULL),
(30, '{\"map\":[\"\"]}', NULL),
(31, '{\"map\":[\"\"]}', NULL),
(32, '{\"map\":[\"\"]}', NULL),
(33, '{\"map\":[\"\"]}', NULL),
(34, '{\"map\":[\"\"]}', NULL),
(35, '{\"map\":[\"\"]}', NULL),
(36, '{\"map\":[\"\"]}', NULL),
(37, '{\"map\":[\"\"]}', NULL),
(38, '{\"map\":[\"\"]}', NULL),
(39, '{\"map\":[\"\"]}', NULL),
(40, '{\"map\":[\"\"]}', NULL),
(41, '{\"map\":[\"\"]}', NULL),
(42, '{\"map\":[\"\"]}', NULL),
(43, '{\"map\":[\"\"]}', NULL),
(44, '{\"map\":[\"\"]}', NULL),
(45, '{\"map\":[\"\"]}', NULL),
(46, '{\"map\":[\"\"]}', NULL),
(47, '{\"map\":[\"\"]}', NULL),
(48, '{\"map\":[\"\"]}', NULL),
(49, '{\"map\":[\"\"]}', NULL),
(50, '{\"map\":[\"\"]}', NULL),
(51, '{\"map\":[\"\"]}', NULL),
(52, '{\"map\":[\"\"]}', NULL),
(53, '{\"map\":[\"\"]}', NULL),
(54, '{\"map\":[\"\"]}', NULL),
(55, '{\"map\":[\"\"]}', NULL),
(56, '{\"map\":[\"\"]}', NULL),
(57, '{\"map\":[\"\"]}', NULL),
(58, '{\"map\":[\"\"]}', NULL),
(59, '{\"map\":[\"\"]}', NULL),
(60, '{\"map\":[\"\"]}', NULL),
(61, '{\"map\":[\"\"]}', NULL),
(62, '{\"map\":[\"\"]}', NULL),
(63, '{\"map\":[\"\"]}', NULL),
(64, '{\"map\":[\"\"]}', NULL),
(65, '{\"map\":[\"\"]}', NULL),
(66, '{\"map\":[\"\"]}', NULL),
(67, '{\"map\":[\"\"]}', NULL),
(68, '{\"map\":[\"\"]}', NULL),
(69, '{\"map\":[\"\"]}', NULL),
(70, '{\"map\":[\"\"]}', NULL),
(71, '{\"map\":[\"\"]}', NULL),
(72, '{\"map\":[\"\"]}', NULL),
(73, '{\"map\":[\"\"]}', NULL),
(74, '{\"map\":[\"\"]}', NULL),
(75, '{\"map\":[\"\"]}', NULL),
(76, '{\"map\":[\"\"]}', NULL),
(77, '{\"map\":[\"\"]}', NULL),
(78, '{\"map\":[\"\"]}', NULL),
(79, '{\"map\":[\"\"]}', NULL),
(80, '{\"map\":[\"\"]}', NULL),
(81, '{\"map\":[\"\"]}', NULL),
(82, '{\"map\":[\"\"]}', NULL),
(83, '{\"map\":[\"\"]}', NULL),
(84, '{\"map\":[\"\"]}', NULL),
(85, '{\"map\":[\"\"]}', NULL),
(86, '{\"map\":[\"\"]}', NULL),
(87, '{\"map\":[\"\"]}', NULL),
(88, '{\"map\":[\"\"]}', NULL),
(89, '{\"map\":[\"\"]}', NULL),
(90, '{\"map\":[\"\"]}', NULL),
(91, '{\"map\":[\"\"]}', NULL),
(92, '{\"map\":[\"\"]}', NULL),
(93, '{\"map\":[\"\"]}', NULL),
(94, '{\"map\":[\"\"]}', NULL),
(95, '{\"map\":[\"\"]}', NULL),
(96, '{\"map\":[\"\"]}', NULL),
(97, '{\"map\":[\"\"]}', NULL),
(98, '{\"map\":[\"\"]}', NULL),
(99, '{\"map\":[\"\"]}', NULL),
(100, '{\"map\":[\"\"]}', NULL),
(101, '{\"map\":[\"\"]}', NULL),
(102, '{\"map\":[\"\"]}', NULL),
(103, '{\"map\":[\"\"]}', NULL),
(104, '{\"map\":[\"\"]}', NULL),
(105, '{\"map\":[\"\"]}', NULL),
(106, '{\"map\":[\"\"]}', NULL),
(107, '{\"map\":[\"\"]}', NULL),
(108, '{\"map\":[\"\"]}', NULL),
(109, '{\"map\":[\"\"]}', NULL),
(110, '{\"map\":[\"\"]}', NULL),
(111, '{\"map\":[\"\"]}', NULL),
(112, '{\"map\":[\"\"]}', NULL),
(113, '{\"map\":[\"\"]}', NULL),
(114, '{\"map\":[\"\"]}', NULL),
(115, '{\"map\":[\"\"]}', NULL),
(116, '{\"map\":[\"\"]}', NULL),
(117, '{\"map\":[\"\"]}', NULL),
(118, '{\"map\":[\"\"]}', NULL),
(119, '{\"map\":[\"\"]}', NULL),
(120, '{\"map\":[\"\"]}', NULL),
(121, '{\"map\":[\"\"]}', NULL);

-- --------------------------------------------------------

--
-- Structure de la table `batch_job_execution_params`
--

DROP TABLE IF EXISTS `batch_job_execution_params`;
CREATE TABLE IF NOT EXISTS `batch_job_execution_params` (
  `JOB_EXECUTION_ID` bigint(20) NOT NULL,
  `TYPE_CD` varchar(6) NOT NULL,
  `KEY_NAME` varchar(100) NOT NULL,
  `STRING_VAL` varchar(250) DEFAULT NULL,
  `DATE_VAL` datetime DEFAULT NULL,
  `LONG_VAL` bigint(20) DEFAULT NULL,
  `DOUBLE_VAL` double DEFAULT NULL,
  `IDENTIFYING` char(1) NOT NULL,
  KEY `JOB_EXEC_PARAMS_FK` (`JOB_EXECUTION_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_job_execution_params`
--

INSERT INTO `batch_job_execution_params` (`JOB_EXECUTION_ID`, `TYPE_CD`, `KEY_NAME`, `STRING_VAL`, `DATE_VAL`, `LONG_VAL`, `DOUBLE_VAL`, `IDENTIFYING`) VALUES
(1, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(2, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 2, 0, 'Y'),
(3, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(4, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 4, 0, 'Y'),
(5, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 5, 0, 'Y'),
(6, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(7, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 6, 0, 'Y'),
(8, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 2, 0, 'Y'),
(9, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 7, 0, 'Y'),
(10, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(11, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(12, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(13, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(14, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(15, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(16, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(17, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(18, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(19, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(20, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(21, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(22, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(23, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(24, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(25, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(26, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(27, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 4, 0, 'Y'),
(28, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 5, 0, 'Y'),
(29, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 6, 0, 'Y'),
(30, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(31, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 8, 0, 'Y'),
(32, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 7, 0, 'Y'),
(33, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 9, 0, 'Y'),
(34, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 9, 0, 'Y'),
(35, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 10, 0, 'Y'),
(36, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 11, 0, 'Y'),
(37, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 12, 0, 'Y'),
(38, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 13, 0, 'Y'),
(39, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 14, 0, 'Y'),
(40, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 15, 0, 'Y'),
(41, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 16, 0, 'Y'),
(42, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 17, 0, 'Y'),
(43, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 18, 0, 'Y'),
(44, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 19, 0, 'Y'),
(45, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 20, 0, 'Y'),
(46, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 21, 0, 'Y'),
(47, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 22, 0, 'Y'),
(48, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 23, 0, 'Y'),
(49, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 24, 0, 'Y'),
(50, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(51, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 2, 0, 'Y'),
(52, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(53, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 4, 0, 'Y'),
(54, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 2, 0, 'Y'),
(55, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(56, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 4, 0, 'Y'),
(57, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 5, 0, 'Y'),
(58, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 6, 0, 'Y'),
(59, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 7, 0, 'Y'),
(60, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 8, 0, 'Y'),
(61, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 9, 0, 'Y'),
(62, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 10, 0, 'Y'),
(63, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 11, 0, 'Y'),
(64, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 12, 0, 'Y'),
(65, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 13, 0, 'Y'),
(66, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 14, 0, 'Y'),
(67, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 15, 0, 'Y'),
(68, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 16, 0, 'Y'),
(69, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 17, 0, 'Y'),
(70, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 18, 0, 'Y'),
(71, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 5, 0, 'Y'),
(72, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 6, 0, 'Y'),
(73, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(74, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(75, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 2, 0, 'Y'),
(76, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(77, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 7, 0, 'Y'),
(78, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 8, 0, 'Y'),
(79, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 8, 0, 'Y'),
(80, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 9, 0, 'Y'),
(81, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 9, 0, 'Y'),
(82, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 10, 0, 'Y'),
(83, 'STRING', 'JobID', '1553425601039', '1970-01-01 01:00:00', 0, 0, 'Y'),
(84, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(84, 'STRING', 'JobID', '1553425601039', '1970-01-01 01:00:00', 0, 0, 'Y'),
(85, 'STRING', 'JobID', '1553425820204', '1970-01-01 01:00:00', 0, 0, 'Y'),
(86, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(86, 'STRING', 'JobID', '1553425820204', '1970-01-01 01:00:00', 0, 0, 'Y'),
(87, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 2, 0, 'Y'),
(87, 'STRING', 'JobID', '1553425820204', '1970-01-01 01:00:00', 0, 0, 'Y'),
(88, 'STRING', 'JobID', '1553429130324', '1970-01-01 01:00:00', 0, 0, 'Y'),
(89, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 1, 0, 'Y'),
(89, 'STRING', 'JobID', '1553429130324', '1970-01-01 01:00:00', 0, 0, 'Y'),
(90, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 2, 0, 'Y'),
(90, 'STRING', 'JobID', '1553429130324', '1970-01-01 01:00:00', 0, 0, 'Y'),
(91, 'LONG', 'run.id', '', '1970-01-01 01:00:00', 3, 0, 'Y'),
(91, 'STRING', 'JobID', '1553429130324', '1970-01-01 01:00:00', 0, 0, 'Y'),
(92, 'STRING', 'JobID', '1553429690836', '1970-01-01 01:00:00', 0, 0, 'Y'),
(93, 'STRING', 'JobID', '1553429746627', '1970-01-01 01:00:00', 0, 0, 'Y'),
(94, 'STRING', 'JobID', '1553429764127', '1970-01-01 01:00:00', 0, 0, 'Y'),
(95, 'STRING', 'JobID', '1553429771958', '1970-01-01 01:00:00', 0, 0, 'Y'),
(96, 'STRING', 'JobID', '1553434126689', '1970-01-01 01:00:00', 0, 0, 'Y'),
(97, 'STRING', 'JobID', '1553434183782', '1970-01-01 01:00:00', 0, 0, 'Y'),
(98, 'STRING', 'JobID', '1553437536397', '1970-01-01 01:00:00', 0, 0, 'Y'),
(99, 'STRING', 'JobID', '1553438648210', '1970-01-01 01:00:00', 0, 0, 'Y'),
(100, 'STRING', 'JobID', '1553438713456', '1970-01-01 01:00:00', 0, 0, 'Y'),
(101, 'STRING', 'JobID', '1553439008539', '1970-01-01 01:00:00', 0, 0, 'Y'),
(102, 'STRING', 'JobID', '1553439082685', '1970-01-01 01:00:00', 0, 0, 'Y'),
(103, 'STRING', 'JobID', '1553439222940', '1970-01-01 01:00:00', 0, 0, 'Y'),
(104, 'STRING', 'JobID', '1553439350224', '1970-01-01 01:00:00', 0, 0, 'Y'),
(105, 'STRING', 'JobID', '1553439381182', '1970-01-01 01:00:00', 0, 0, 'Y'),
(106, 'STRING', 'JobID', '1553439618268', '1970-01-01 01:00:00', 0, 0, 'Y'),
(107, 'STRING', 'JobID', '1553439772230', '1970-01-01 01:00:00', 0, 0, 'Y'),
(108, 'STRING', 'JobID', '1553439867116', '1970-01-01 01:00:00', 0, 0, 'Y'),
(109, 'STRING', 'JobID', '1553439964239', '1970-01-01 01:00:00', 0, 0, 'Y'),
(110, 'STRING', 'JobID', '1553440321781', '1970-01-01 01:00:00', 0, 0, 'Y'),
(111, 'STRING', 'JobID', '1553440393043', '1970-01-01 01:00:00', 0, 0, 'Y'),
(112, 'STRING', 'JobID', '1553440590003', '1970-01-01 01:00:00', 0, 0, 'Y'),
(113, 'STRING', 'ecolis.file.path.xml', 'd:\\chemin_vers_fichier', '1970-01-01 01:00:00', 0, 0, 'Y'),
(114, 'STRING', 'ecolis.file.path.xml', 'file:d:\\chemin_vers_fichier', '1970-01-01 01:00:00', 0, 0, 'Y'),
(115, 'STRING', 'ecolis.file.path.xml', 'D:/Outils_Dev/Workspaces/WS-JEE/ecoliss-batch/src/main/resources/alertes.xml', '1970-01-01 01:00:00', 0, 0, 'Y'),
(117, 'LONG', 'time', '', '1970-01-01 01:00:00', 1553496688903, 0, 'Y'),
(117, 'STRING', 'ecolis.file.path.xml', 'D:/Outils_Dev/Workspaces/WS-JEE/ecoliss-batch/src/main/resources/alertes.xml', '1970-01-01 01:00:00', 0, 0, 'Y'),
(118, 'LONG', 'time', '', '1970-01-01 01:00:00', 1553496821826, 0, 'Y'),
(118, 'STRING', 'ecolis.file.path.xml', 'D:/Outils_Dev/Workspaces/WS-JEE/ecoliss-batch/src/main/resources/alertes.xml', '1970-01-01 01:00:00', 0, 0, 'Y'),
(119, 'LONG', 'time', '', '1970-01-01 01:00:00', 1553496855888, 0, 'Y'),
(119, 'STRING', 'ecolis.file.path.xml', 'D:/Outils_Dev/Workspaces/WS-JEE/ecoliss-batch/src/main/resources/alertes.xml', '1970-01-01 01:00:00', 0, 0, 'Y'),
(120, 'LONG', 'time', '', '1970-01-01 01:00:00', 1553547425895, 0, 'Y'),
(120, 'STRING', 'ecolis.file.path.xml', 'D:/Outils_Dev/Workspaces/WS-JEE/ecoliss-batch/src/main/resources/alertes.xml', '1970-01-01 01:00:00', 0, 0, 'Y'),
(121, 'LONG', 'time', '', '1970-01-01 01:00:00', 1553547864013, 0, 'Y'),
(121, 'STRING', 'ecolis.file.path.xml', 'D:/Outils_Dev/Workspaces/WS-JEE/ecoliss-batch/src/main/resources/alertes.xml', '1970-01-01 01:00:00', 0, 0, 'Y');

-- --------------------------------------------------------

--
-- Structure de la table `batch_job_execution_seq`
--

DROP TABLE IF EXISTS `batch_job_execution_seq`;
CREATE TABLE IF NOT EXISTS `batch_job_execution_seq` (
  `ID` bigint(20) NOT NULL,
  `UNIQUE_KEY` char(1) NOT NULL,
  UNIQUE KEY `UNIQUE_KEY_UN` (`UNIQUE_KEY`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_job_execution_seq`
--

INSERT INTO `batch_job_execution_seq` (`ID`, `UNIQUE_KEY`) VALUES
(121, '0');

-- --------------------------------------------------------

--
-- Structure de la table `batch_job_instance`
--

DROP TABLE IF EXISTS `batch_job_instance`;
CREATE TABLE IF NOT EXISTS `batch_job_instance` (
  `JOB_INSTANCE_ID` bigint(20) NOT NULL,
  `VERSION` bigint(20) DEFAULT NULL,
  `JOB_NAME` varchar(100) NOT NULL,
  `JOB_KEY` varchar(32) NOT NULL,
  PRIMARY KEY (`JOB_INSTANCE_ID`),
  UNIQUE KEY `JOB_INST_UN` (`JOB_NAME`,`JOB_KEY`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_job_instance`
--

INSERT INTO `batch_job_instance` (`JOB_INSTANCE_ID`, `VERSION`, `JOB_NAME`, `JOB_KEY`) VALUES
(1, 0, 'importUserJob', '853d3449e311f40366811cbefb3d93d7'),
(2, 0, 'importUserJob', 'e070bff4379694c0210a51d9f6c6a564'),
(3, 0, 'importUserJob', 'a3364faf893276dea0caacefbf618db5'),
(4, 0, 'importUserJob', '47c0a8118b74165a864b66d37c7b6cf5'),
(5, 0, 'importUserJob', 'ce148f5f9c2bf4dc9bd44a7a5f64204c'),
(6, 0, 'compositeJobTask', '853d3449e311f40366811cbefb3d93d7'),
(7, 0, 'importUserJob', 'bd0034040292bc81e6ccac0e25d9a578'),
(8, 0, 'compositeJobTask', 'e070bff4379694c0210a51d9f6c6a564'),
(9, 0, 'importUserJob', '597815c7e4ab1092c1b25130aae725cb'),
(10, 0, 'compositeJobTask', 'a3364faf893276dea0caacefbf618db5'),
(11, 0, 'compositeJobTask', '47c0a8118b74165a864b66d37c7b6cf5'),
(12, 0, 'compositeJobTask', 'ce148f5f9c2bf4dc9bd44a7a5f64204c'),
(13, 0, 'compositeJobTask', 'bd0034040292bc81e6ccac0e25d9a578'),
(14, 0, 'importAlerteTaskJob', '853d3449e311f40366811cbefb3d93d7'),
(15, 0, 'importUserJob', 'f55a96b11012be4fcfb6cf005435182d'),
(16, 0, 'compositeJobTask', '597815c7e4ab1092c1b25130aae725cb'),
(17, 0, 'importUserJob', '96a5ed9bac43e779455f3e71c0f64840'),
(18, 0, 'importUserJob', '1aac4f3e74894b78fa3ce5d8a25e1ef0'),
(19, 0, 'importUserJob', '604bbfc4c68cb1f903780c2853ad4801'),
(20, 0, 'importUserJob', '556ebe34220b4032509f2581356ba47c'),
(21, 0, 'importUserJob', 'edc440efb5ddd2a3b2622f16a12bf105'),
(22, 0, 'importUserJob', 'f3d5e568c384ee72cba8bc6a51057fe4'),
(23, 0, 'importUserJob', '378ef1ecb81cf9edac4ab119bdab9d9d'),
(24, 0, 'importUserJob', 'e073471cc312cadef424c3be7915c0af'),
(25, 0, 'importUserJob', '46ba78a99abf1e2fba4a8861749d7572'),
(26, 0, 'importUserJob', 'b88d31b704adf9f94fe9d4ccff795708'),
(27, 0, 'importUserJob', '64d4e6d635ee3ad949314224afce46c2'),
(28, 0, 'importUserJob', '75c16c09800a944220a789de10278de0'),
(29, 0, 'importUserJob', '1b759d32440acdcbf90da6919b5d16ad'),
(30, 0, 'importUserJob', '1f995cec4b562af773a2e473c369f069'),
(31, 0, 'importUserJob', '42106293a859255c2b210d04a51240ca'),
(32, 0, 'importUserJob', '9799b3a84f4d6f15a5e8c11360e7387b'),
(33, 0, 'jobTask', '853d3449e311f40366811cbefb3d93d7'),
(34, 0, 'jobTask', 'e070bff4379694c0210a51d9f6c6a564'),
(35, 0, 'jobTask', 'a3364faf893276dea0caacefbf618db5'),
(36, 0, 'jobTask', '47c0a8118b74165a864b66d37c7b6cf5'),
(37, 0, 'importAlerteTaskJob', 'e070bff4379694c0210a51d9f6c6a564'),
(38, 0, 'importAlerteTaskJob', 'a3364faf893276dea0caacefbf618db5'),
(39, 0, 'importAlerteTaskJob', '47c0a8118b74165a864b66d37c7b6cf5'),
(40, 0, 'importAlerteTaskJob', 'ce148f5f9c2bf4dc9bd44a7a5f64204c'),
(41, 0, 'importAlerteTaskJob', 'bd0034040292bc81e6ccac0e25d9a578'),
(42, 0, 'importAlerteTaskJob', '597815c7e4ab1092c1b25130aae725cb'),
(43, 0, 'importAlerteTaskJob', 'f55a96b11012be4fcfb6cf005435182d'),
(44, 0, 'importAlerteTaskJob', '96a5ed9bac43e779455f3e71c0f64840'),
(45, 0, 'importAlerteTaskJob', '1aac4f3e74894b78fa3ce5d8a25e1ef0'),
(46, 0, 'importAlerteTaskJob', '604bbfc4c68cb1f903780c2853ad4801'),
(47, 0, 'importAlerteTaskJob', '556ebe34220b4032509f2581356ba47c'),
(48, 0, 'importAlerteTaskJob', 'edc440efb5ddd2a3b2622f16a12bf105'),
(49, 0, 'importAlerteTaskJob', 'f3d5e568c384ee72cba8bc6a51057fe4'),
(50, 0, 'importAlerteTaskJob', '378ef1ecb81cf9edac4ab119bdab9d9d'),
(51, 0, 'importAlerteTaskJob', 'e073471cc312cadef424c3be7915c0af'),
(52, 0, 'importAlerteTaskJob', '46ba78a99abf1e2fba4a8861749d7572'),
(53, 0, 'importAlerteTaskJob', 'b88d31b704adf9f94fe9d4ccff795708'),
(54, 0, 'jobTask', 'ce148f5f9c2bf4dc9bd44a7a5f64204c'),
(55, 0, 'jobTask', 'bd0034040292bc81e6ccac0e25d9a578'),
(56, 0, 'jobUserTask', '853d3449e311f40366811cbefb3d93d7'),
(57, 0, 'jobUserTask', 'e070bff4379694c0210a51d9f6c6a564'),
(58, 0, 'jobUserTask', 'a3364faf893276dea0caacefbf618db5'),
(59, 0, 'jobTask', '597815c7e4ab1092c1b25130aae725cb'),
(60, 0, 'jobTask', 'f55a96b11012be4fcfb6cf005435182d'),
(61, 0, 'compositeJobTask', 'f55a96b11012be4fcfb6cf005435182d'),
(62, 0, 'jobTask', '96a5ed9bac43e779455f3e71c0f64840'),
(63, 0, 'jobTask', '1aac4f3e74894b78fa3ce5d8a25e1ef0'),
(64, 0, 'jobTask', 'a6afdd08a83c74c86204b97ed2790ad3'),
(65, 0, 'jobTask', '69e6dcae1b8f81f26fd46c37af26f34b'),
(66, 0, 'jobTask', '097695419e2f97f0b465bffbd5287c55'),
(67, 0, 'jobTask', '1e61b88b270f226c6c31518919effaa3'),
(68, 0, 'jobTask', '9a5b79134a8d2cf2094889383cd60207'),
(69, 0, 'jobTask', '3e9bf95acec7caef01ad9d1bf0e875fe'),
(70, 0, 'jobTask', '239c1856b20288a5374252c72663527f'),
(71, 0, 'jobTask', 'c1bc42c19f62a3de9b006c9f897b119f'),
(72, 0, 'jobTask', 'ebbb793428b14cc0baeb1e29c1691b38'),
(73, 0, 'jobTask', 'eb86f63d191a946f72ed85ae9abd74a7'),
(74, 0, 'jobTask', 'e7aafca8c9d0fdeac5b68869ae53ace5'),
(75, 0, 'jobTask', '760ceaa4497e3c5da166a5b3607bb1df'),
(76, 0, 'jobTask', 'ef2642690b2b9b80fc301f49e92e7d80'),
(77, 0, 'jobTask', '4c44ec385bc5110cbc1a6c41cefa33a7'),
(78, 0, 'jobTask', '32ecbe6e81882ea360472fa3341ca28e'),
(79, 0, 'jobTask', '8547169b1ec77c30c9c905f2103454f4'),
(80, 0, 'jobTask', '7606e263709849f5463208c082852780'),
(81, 0, 'jobTask', '969bd8f5f7a27fa45cdf382c723e935e'),
(82, 0, 'jobTask', 'a001559ed94de479f992a7a82144340d'),
(83, 0, 'jobTask', '1af4c2d5393711fab2deef8e810b2132'),
(84, 0, 'jobTask', '7d2142af8e8cc55df9104d6493628e3c'),
(85, 0, 'jobTask', '0b821f56449c7506e41ee9d398420d00'),
(86, 0, 'jobTask', 'faf4b485c26bed6ee63351061d41c063'),
(87, 0, 'jobTask', '00375f45ca0f69be93df69f59529260b'),
(88, 0, 'jobTask', '068df6c6a535af2c837731cc94f33cfc'),
(89, 0, 'jobTask', '7c66183986b0e47bb19d391ed1281c8a'),
(90, 0, 'jobTask', '1c01986462efcc272fb5c8250f894064'),
(91, 0, 'jobTask', '29d526d742d5db3faf234aab0f25efb3'),
(92, 0, 'jobTask', '326a502c4dfaa90d790434122f179ab0'),
(93, 0, 'jobTask', 'e3dff186730ad52d30eaf99998b9c989'),
(94, 0, 'jobTask', '66747e0eab554ef87d37b0dd241f642e'),
(95, 0, 'jobTask', '538db61d2422056862f3654ae53b7ef7'),
(96, 0, 'jobTask', '7aac554299e41a2ebbba0fd974a21341'),
(97, 0, 'jobTask', 'd41d8cd98f00b204e9800998ecf8427e'),
(98, 0, 'jobTask', 'a7af254d80eada2c719586c3cbda1b86'),
(99, 0, 'jobTask', 'd2b275b1c94bcbfb44dc613aa2418182'),
(100, 0, 'jobTask', '1a247be5ab64adcc46aa69ce02274657'),
(101, 0, 'jobTask', 'f534ebe81b27a791797c20dd6b32cb85'),
(102, 0, 'jobTask', '6234d99b9ce6f66be54ac8646154ad1d');

-- --------------------------------------------------------

--
-- Structure de la table `batch_job_seq`
--

DROP TABLE IF EXISTS `batch_job_seq`;
CREATE TABLE IF NOT EXISTS `batch_job_seq` (
  `ID` bigint(20) NOT NULL,
  `UNIQUE_KEY` char(1) NOT NULL,
  UNIQUE KEY `UNIQUE_KEY_UN` (`UNIQUE_KEY`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_job_seq`
--

INSERT INTO `batch_job_seq` (`ID`, `UNIQUE_KEY`) VALUES
(102, '0');

-- --------------------------------------------------------

--
-- Structure de la table `batch_step_execution`
--

DROP TABLE IF EXISTS `batch_step_execution`;
CREATE TABLE IF NOT EXISTS `batch_step_execution` (
  `STEP_EXECUTION_ID` bigint(20) NOT NULL,
  `VERSION` bigint(20) NOT NULL,
  `STEP_NAME` varchar(100) NOT NULL,
  `JOB_EXECUTION_ID` bigint(20) NOT NULL,
  `START_TIME` datetime NOT NULL,
  `END_TIME` datetime DEFAULT NULL,
  `STATUS` varchar(10) DEFAULT NULL,
  `COMMIT_COUNT` bigint(20) DEFAULT NULL,
  `READ_COUNT` bigint(20) DEFAULT NULL,
  `FILTER_COUNT` bigint(20) DEFAULT NULL,
  `WRITE_COUNT` bigint(20) DEFAULT NULL,
  `READ_SKIP_COUNT` bigint(20) DEFAULT NULL,
  `WRITE_SKIP_COUNT` bigint(20) DEFAULT NULL,
  `PROCESS_SKIP_COUNT` bigint(20) DEFAULT NULL,
  `ROLLBACK_COUNT` bigint(20) DEFAULT NULL,
  `EXIT_CODE` varchar(2500) DEFAULT NULL,
  `EXIT_MESSAGE` varchar(2500) DEFAULT NULL,
  `LAST_UPDATED` datetime DEFAULT NULL,
  PRIMARY KEY (`STEP_EXECUTION_ID`),
  KEY `JOB_EXEC_STEP_FK` (`JOB_EXECUTION_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_step_execution`
--

INSERT INTO `batch_step_execution` (`STEP_EXECUTION_ID`, `VERSION`, `STEP_NAME`, `JOB_EXECUTION_ID`, `START_TIME`, `END_TIME`, `STATUS`, `COMMIT_COUNT`, `READ_COUNT`, `FILTER_COUNT`, `WRITE_COUNT`, `READ_SKIP_COUNT`, `WRITE_SKIP_COUNT`, `PROCESS_SKIP_COUNT`, `ROLLBACK_COUNT`, `EXIT_CODE`, `EXIT_MESSAGE`, `LAST_UPDATED`) VALUES
(1, 3, 'step1', 1, '2017-07-02 00:11:21', '2017-07-02 00:11:21', 'COMPLETED', 1, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 00:11:21'),
(2, 3, 'step1', 2, '2017-07-02 08:54:52', '2017-07-02 08:54:52', 'COMPLETED', 1, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 08:54:52'),
(3, 3, 'step1', 3, '2017-07-02 08:59:09', '2017-07-02 08:59:09', 'COMPLETED', 1, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 08:59:09'),
(4, 5, 'step1', 4, '2017-07-02 09:01:23', '2017-07-02 09:01:23', 'COMPLETED', 3, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 09:01:23'),
(5, 5, 'step1', 5, '2017-07-02 09:51:10', '2017-07-02 09:51:10', 'COMPLETED', 3, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 09:51:10'),
(6, 5, 'step1', 6, '2017-07-02 11:09:46', '2017-07-02 11:09:46', 'COMPLETED', 3, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 11:09:46'),
(7, 5, 'step1', 7, '2017-07-02 11:09:46', '2017-07-02 11:09:46', 'COMPLETED', 3, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 11:09:46'),
(8, 5, 'step1', 8, '2017-07-02 11:11:51', '2017-07-02 11:11:51', 'COMPLETED', 3, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 11:11:51'),
(9, 5, 'step1', 9, '2017-07-02 11:11:51', '2017-07-02 11:11:51', 'COMPLETED', 3, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 11:11:51'),
(10, 2, 'step1', 10, '2017-07-02 11:14:45', '2017-07-02 11:14:45', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 1 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000001d:/disqueimage/images1.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.jav', '2017-07-02 11:14:45'),
(11, 2, 'step1', 11, '2017-07-02 11:15:47', '2017-07-02 11:15:47', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 1 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000001d:/disqueimage/images1.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.jav', '2017-07-02 11:15:47'),
(12, 2, 'step1', 12, '2017-07-02 11:16:01', '2017-07-02 11:16:01', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 1 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000001d:/disqueimage/images1.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.jav', '2017-07-02 11:16:01'),
(13, 2, 'step1', 13, '2017-07-02 11:16:15', '2017-07-02 11:16:15', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 1 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000001d:/disqueimage/images1.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.jav', '2017-07-02 11:16:15'),
(14, 3, 'step1', 14, '2017-07-02 11:17:04', '2017-07-02 11:17:04', 'FAILED', 1, 1, 0, 1, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 2 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**ALR**,1,Paris-France,Rennes-France,czome@yahoo.fr         ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlo', '2017-07-02 11:17:04'),
(15, 2, 'step1', 15, '2017-07-02 11:21:22', '2017-07-02 11:21:22', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 2 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**ALR**,1,Paris-France,Rennes-France,czome@yahoo.fr         ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlo', '2017-07-02 11:21:22'),
(16, 2, 'step1', 16, '2017-07-02 11:21:54', '2017-07-02 11:21:54', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 2 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**ALR**,1,Paris-France,Rennes-France,czome@yahoo.fr         ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlo', '2017-07-02 11:21:54'),
(17, 4, 'step1', 17, '2017-07-02 11:24:20', '2017-07-02 11:24:20', 'FAILED', 2, 2, 0, 2, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-02 11:24:20'),
(18, 2, 'step1', 18, '2017-07-02 11:24:46', '2017-07-02 11:24:46', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-02 11:24:46'),
(19, 2, 'step1', 19, '2017-07-02 11:25:04', '2017-07-02 11:25:04', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-02 11:25:04'),
(20, 2, 'step1', 20, '2017-07-02 11:25:32', '2017-07-02 11:25:32', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-02 11:25:32'),
(21, 2, 'step1', 21, '2017-07-02 11:26:13', '2017-07-02 11:26:13', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-02 11:26:13'),
(22, 2, 'step1', 22, '2017-07-02 16:46:06', '2017-07-02 16:46:06', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png   ]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-02 16:46:06'),
(23, 2, 'step1', 23, '2017-07-02 16:47:09', '2017-07-02 16:47:09', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:', '2017-07-02 16:47:09'),
(24, 2, 'step1', 24, '2017-07-02 16:50:09', '2017-07-02 16:50:09', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:', '2017-07-02 16:50:09'),
(25, 2, 'step1', 25, '2017-07-02 16:51:27', '2017-07-02 16:51:27', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 4 in resource=[class path resource [fichierImageEtAlerte.txt]], input=[**IMG**00000000010d:/disqueimage/images10.png]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:', '2017-07-02 16:51:27'),
(26, 5, 'step1', 26, '2017-07-02 16:52:01', '2017-07-02 16:52:01', 'COMPLETED', 3, 2, 0, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 16:52:01'),
(27, 8, 'step1', 27, '2017-07-02 16:55:32', '2017-07-02 16:55:32', 'COMPLETED', 6, 5, 0, 5, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 16:55:32'),
(28, 8, 'step1', 28, '2017-07-02 17:44:28', '2017-07-02 17:44:28', 'COMPLETED', 6, 5, 0, 5, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 17:44:28'),
(29, 8, 'step1', 29, '2017-07-02 17:45:24', '2017-07-02 17:45:24', 'COMPLETED', 6, 5, 0, 5, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 17:45:24'),
(30, 6, 'step1', 30, '2017-07-02 17:47:29', '2017-07-02 17:47:29', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-02 17:47:29'),
(31, 8, 'step1', 31, '2017-07-03 23:11:54', '2017-07-03 23:11:54', 'COMPLETED', 6, 5, 0, 5, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:11:54'),
(32, 8, 'step1', 32, '2017-07-03 23:11:54', '2017-07-03 23:11:55', 'COMPLETED', 6, 5, 0, 5, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:11:55'),
(33, 2, 'step1', 33, '2017-07-03 23:12:44', '2017-07-03 23:12:44', 'FAILED', 0, 1, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.core.listener.StepListenerFailedException: Error in afterProcess.\r\n	at org.springframework.batch.core.listener.MulticasterBatchListener.afterProcess(MulticasterBatchListener.java:136)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.doProcess(SimpleChunkProcessor.java:127)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.transform(SimpleChunkProcessor.java:293)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.process(SimpleChunkProcessor.java:192)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:75)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:64)\r\n	at org.springframework.batch.core.job.flow.support.state.StepState.handle(StepState.java:67)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.resume(SimpleFlow.java:169)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.start(SimpleFlow.java:144)\r\n	at org.springframework.batch.core.job.flow.FlowJob.doExecute(FlowJob.java:134)\r\n	at org.springframework.batch.core.job.AbstractJob.execute(AbstractJob.java:306)\r\n	at org.springframework.batch.core.launch.support.SimpleJobLauncher$1.run(SimpleJobLauncher.java:135)\r\n	at org.springframework.core.task.SyncTaskExecutor.execute(SyncTaskExec', '2017-07-03 23:12:44'),
(34, 6, 'step1', 34, '2017-07-03 23:37:25', '2017-07-03 23:37:25', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:37:25'),
(35, 6, 'step1', 35, '2017-07-03 23:38:32', '2017-07-03 23:38:32', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:38:32'),
(36, 6, 'step1', 36, '2017-07-03 23:39:36', '2017-07-03 23:39:36', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:39:36'),
(37, 6, 'step1', 37, '2017-07-03 23:40:01', '2017-07-03 23:40:02', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:40:02'),
(38, 6, 'step1', 38, '2017-07-03 23:44:43', '2017-07-03 23:44:44', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:44:44'),
(39, 6, 'step1', 39, '2017-07-03 23:45:25', '2017-07-03 23:45:25', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:45:25'),
(40, 6, 'step1', 40, '2017-07-03 23:45:47', '2017-07-03 23:45:47', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:45:47'),
(41, 6, 'step1', 41, '2017-07-03 23:46:20', '2017-07-03 23:46:20', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:46:20'),
(42, 6, 'step1', 42, '2017-07-03 23:46:35', '2017-07-03 23:46:35', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:46:35'),
(43, 6, 'step1', 43, '2017-07-03 23:52:43', '2017-07-03 23:52:43', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:52:43'),
(44, 3, 'step1', 44, '2017-07-03 23:54:05', NULL, 'STARTED', 2, 2, 1, 1, 0, 0, 0, 0, 'EXECUTING', '', '2017-07-03 23:55:39'),
(45, 1, 'step1', 45, '2017-07-03 23:56:30', NULL, 'STARTED', 0, 0, 0, 0, 0, 0, 0, 0, 'EXECUTING', '', '2017-07-03 23:56:30'),
(46, 2, 'step1', 46, '2017-07-03 23:57:04', NULL, 'STARTED', 1, 1, 0, 1, 0, 0, 0, 0, 'EXECUTING', '', '2017-07-03 23:57:04');
INSERT INTO `batch_step_execution` (`STEP_EXECUTION_ID`, `VERSION`, `STEP_NAME`, `JOB_EXECUTION_ID`, `START_TIME`, `END_TIME`, `STATUS`, `COMMIT_COUNT`, `READ_COUNT`, `FILTER_COUNT`, `WRITE_COUNT`, `READ_SKIP_COUNT`, `WRITE_SKIP_COUNT`, `PROCESS_SKIP_COUNT`, `ROLLBACK_COUNT`, `EXIT_CODE`, `EXIT_MESSAGE`, `LAST_UPDATED`) VALUES
(47, 6, 'step1', 47, '2017-07-03 23:58:27', '2017-07-03 23:58:28', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-03 23:58:28'),
(48, 6, 'step1', 48, '2017-07-04 07:15:50', '2017-07-04 07:15:51', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-04 07:15:51'),
(49, 6, 'step1', 49, '2017-07-04 07:21:16', '2017-07-04 07:21:16', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-04 07:21:16'),
(50, 6, 'step1', 50, '2017-07-04 20:57:54', '2017-07-04 20:57:54', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-04 20:57:54'),
(51, 6, 'step1', 51, '2017-07-04 20:59:48', '2017-07-04 20:59:48', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-04 20:59:48'),
(52, 6, 'step1', 52, '2017-07-04 21:21:32', '2017-07-04 21:21:32', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-04 21:21:32'),
(53, 6, 'step1', 53, '2017-07-04 21:21:49', '2017-07-04 21:21:49', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-04 21:21:49'),
(54, 6, 'step1', 54, '2017-07-07 10:45:19', '2017-07-07 10:45:19', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 10:45:19'),
(55, 6, 'step1', 55, '2017-07-07 10:45:43', '2017-07-07 10:45:43', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 10:45:43'),
(56, 6, 'stepBeanAlerte', 56, '2017-07-07 11:36:30', '2017-07-07 11:36:30', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 11:36:30'),
(57, 6, 'stepBeanAlerte', 57, '2017-07-07 11:41:35', '2017-07-07 11:41:35', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 11:41:35'),
(58, 4, 'stepBeanAlerte', 58, '2017-07-07 13:33:03', '2017-07-07 13:33:03', 'FAILED', 2, 2, 0, 2, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 3 in resource=[class path resource [alertes.txt]], input=[AA,Bruxelles-Belgique,Montreal-CANADA,emmanuel.macron@gouv.fr]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-07 13:33:03'),
(59, 6, 'stepBeanAlerte', 59, '2017-07-07 13:33:59', '2017-07-07 13:33:59', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 13:33:59'),
(60, 4, 'stepBeanAlerte', 60, '2017-07-07 13:41:20', '2017-07-07 13:41:20', 'FAILED', 2, 2, 0, 2, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 3 in resource=[class path resource [alertes.txt]], input=[AA,Bruxelles-Belgique,Montreal-CANADA,emmanuel.macron@gouv.fr]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-07 13:41:20'),
(61, 6, 'stepBeanAlerte', 61, '2017-07-07 13:41:50', '2017-07-07 13:41:50', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 13:41:50'),
(62, 4, 'stepBeanAlerte', 62, '2017-07-07 13:43:16', '2017-07-07 13:43:16', 'FAILED', 2, 2, 0, 2, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 3 in resource=[class path resource [alertes.txt]], input=[AA,Bruxelles-Belgique,Montreal-CANADA,emmanuel.macron@gouv.fr]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.ja', '2017-07-07 13:43:16'),
(63, 6, 'stepBeanAlerte', 63, '2017-07-07 13:44:08', '2017-07-07 13:44:09', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 13:44:09'),
(64, 2, 'stepBeanAlerte', 64, '2017-07-07 14:09:43', '2017-07-07 14:09:43', 'FAILED', 0, 1, 0, 0, 0, 0, 0, 1, 'FAILED', 'java.lang.NullPointerException\r\n	at eu.fr.insee.formation.batch.ecolis.processor.AlerteProcessor.process(AlerteProcessor.java:19)\r\n	at eu.fr.insee.formation.batch.ecolis.processor.AlerteProcessor.process(AlerteProcessor.java:1)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.doProcess(SimpleChunkProcessor.java:126)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.transform(SimpleChunkProcessor.java:293)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.process(SimpleChunkProcessor.java:192)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:75)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:64)\r\n	at org.springframework.batch.core.job.flow.support.state.StepState.handle(StepState.java:67)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.resume(SimpleFlow.java:169)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.start(SimpleFlow.java:144)\r\n	at org.springframework.batch.core.job.flow.FlowJob.doExecute(FlowJob.java:134)\r\n	at org.springframework.batch.core.job.AbstractJob.execute(AbstractJob.java:306)\r\n	at org.springframework.batch.core.launch.support.SimpleJobLauncher$1.run(SimpleJobLauncher.java:135)\r\n	at org.springframework.core.task.SyncTaskExecutor.ex', '2017-07-07 14:09:43'),
(65, 2, 'stepBeanAlerte', 65, '2017-07-07 14:20:03', '2017-07-07 14:20:03', 'FAILED', 0, 1, 0, 0, 0, 0, 0, 1, 'FAILED', 'java.lang.NullPointerException\r\n	at eu.fr.insee.formation.batch.ecolis.processor.AlerteProcessor.process(AlerteProcessor.java:23)\r\n	at eu.fr.insee.formation.batch.ecolis.processor.AlerteProcessor.process(AlerteProcessor.java:1)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.doProcess(SimpleChunkProcessor.java:126)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.transform(SimpleChunkProcessor.java:293)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.process(SimpleChunkProcessor.java:192)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:75)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:64)\r\n	at org.springframework.batch.core.job.flow.support.state.StepState.handle(StepState.java:67)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.resume(SimpleFlow.java:169)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.start(SimpleFlow.java:144)\r\n	at org.springframework.batch.core.job.flow.FlowJob.doExecute(FlowJob.java:134)\r\n	at org.springframework.batch.core.job.AbstractJob.execute(AbstractJob.java:306)\r\n	at org.springframework.batch.core.launch.support.SimpleJobLauncher$1.run(SimpleJobLauncher.java:135)\r\n	at org.springframework.core.task.SyncTaskExecutor.ex', '2017-07-07 14:20:03'),
(66, 2, 'stepBeanAlerte', 66, '2017-07-07 14:20:44', '2017-07-07 14:20:44', 'FAILED', 0, 1, 0, 0, 0, 0, 0, 1, 'FAILED', 'java.lang.NullPointerException\r\n	at eu.fr.insee.formation.batch.ecolis.processor.AlerteProcessor.process(AlerteProcessor.java:25)\r\n	at eu.fr.insee.formation.batch.ecolis.processor.AlerteProcessor.process(AlerteProcessor.java:1)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.doProcess(SimpleChunkProcessor.java:126)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.transform(SimpleChunkProcessor.java:293)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.process(SimpleChunkProcessor.java:192)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:75)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:64)\r\n	at org.springframework.batch.core.job.flow.support.state.StepState.handle(StepState.java:67)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.resume(SimpleFlow.java:169)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.start(SimpleFlow.java:144)\r\n	at org.springframework.batch.core.job.flow.FlowJob.doExecute(FlowJob.java:134)\r\n	at org.springframework.batch.core.job.AbstractJob.execute(AbstractJob.java:306)\r\n	at org.springframework.batch.core.launch.support.SimpleJobLauncher$1.run(SimpleJobLauncher.java:135)\r\n	at org.springframework.core.task.SyncTaskExecutor.ex', '2017-07-07 14:20:44'),
(67, 6, 'stepBeanAlerte', 67, '2017-07-07 14:21:15', '2017-07-07 14:21:16', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 14:21:16'),
(68, 2, 'stepBeanAlerte', 68, '2017-07-07 14:22:14', '2017-07-07 14:22:14', 'FAILED', 0, 1, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.dao.InvalidDataAccessApiUsageException: org.hibernate.TransientPropertyValueException: object references an unsaved transient instance - save the transient instance before flushing : eu.fr.insee.formation.business.entity.Alerte.utilisateur -> eu.fr.insee.formation.business.entity.Utilisateur; nested exception is java.lang.IllegalStateException: org.hibernate.TransientPropertyValueException: object references an unsaved transient instance - save the transient instance before flushing : eu.fr.insee.formation.business.entity.Alerte.utilisateur -> eu.fr.insee.formation.business.entity.Utilisateur\r\n	at org.springframework.orm.jpa.EntityManagerFactoryUtils.convertJpaAccessExceptionIfPossible(EntityManagerFactoryUtils.java:381)\r\n	at org.springframework.orm.jpa.vendor.HibernateJpaDialect.translateExceptionIfPossible(HibernateJpaDialect.java:246)\r\n	at org.springframework.orm.jpa.AbstractEntityManagerFactoryBean.translateExceptionIfPossible(AbstractEntityManagerFactoryBean.java:491)\r\n	at org.springframework.dao.support.ChainedPersistenceExceptionTranslator.translateExceptionIfPossible(ChainedPersistenceExceptionTranslator.java:59)\r\n	at org.springframework.dao.support.DataAccessUtils.translateIfNecessary(DataAccessUtils.java:213)\r\n	at org.springframework.dao.support.PersistenceExceptionTranslationInterceptor.invoke(PersistenceExceptionTranslationInterceptor.java:147)\r\n	at org.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:179)\r\n	at org.springframework.data.jpa.repository.support.CrudMethodMetadataPostProcessor$CrudMethodMetadataPopulatingMethodInterceptor.invoke(CrudMethodMetadataPostProcessor.java:133)\r\n	at org.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:179)\r\n	at org.springframework.aop.interceptor.ExposeInvocationInterceptor.invoke(ExposeInvocationInterceptor.java:92)\r\n	at org.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:179)\r\n	at org.springframework.aop.framework.JdkDynamicAopProxy.invoke(JdkDynamicAopProxy.java:213)\r\n	at com.sun.proxy.$Proxy76.saveAndFlush(Unknown Source)\r\n	at eu.fr.insee.formation.business.ecolis.service.impl.AlerteServiceImpl.createUpdateEntity(AlerteServiceImpl.java:31)\r\n	at eu.fr.insee.formation.batch.ecolis.writer.AlerteItemWriter.write(AlerteItemWriter.java:21)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProcessor.writeItems(SimpleChunkProcessor.java:175)', '2017-07-07 14:22:14'),
(69, 6, 'stepBeanAlerte', 69, '2017-07-07 14:22:34', '2017-07-07 14:22:34', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-07-07 14:22:34'),
(70, 6, 'stepBeanAlerte', 70, '2017-12-10 11:26:03', '2017-12-10 11:26:03', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2017-12-10 11:26:03'),
(71, 6, 'step1', 71, '2019-03-10 14:35:00', '2019-03-10 14:35:00', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-10 14:35:00'),
(72, 6, 'step1', 72, '2019-03-11 07:05:58', '2019-03-11 07:05:58', 'COMPLETED', 4, 3, 1, 2, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-11 07:05:58'),
(73, 7, 'step1', 73, '2019-03-11 07:11:06', '2019-03-11 07:11:07', 'FAILED', 5, 5, 1, 4, 0, 0, 0, 1, 'FAILED', 'org.springframework.batch.item.file.FlatFileParseException: Parsing error at line: 8 in resource=[class path resource [utilisateur_a_creer.txt]], input=[]\r\n	at org.springframework.batch.item.file.FlatFileItemReader.doRead(FlatFileItemReader.java:183)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.doExecute(TaskletStep.java:257)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:200)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:64)\r\n	at org.springframework.batch.core.job.fl', '2019-03-11 07:11:07'),
(74, 3, 'step1', 74, '2019-03-11 07:13:02', '2019-03-11 07:13:02', 'COMPLETED', 1, 0, 0, 0, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-11 07:13:02'),
(75, 1, 'step1', 75, '2019-03-11 07:14:43', NULL, 'STARTED', 0, 0, 0, 0, 0, 0, 0, 0, 'EXECUTING', '', '2019-03-11 07:14:43'),
(76, 8, 'step1', 76, '2019-03-11 07:15:57', '2019-03-11 07:15:57', 'COMPLETED', 6, 5, 1, 4, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-11 07:15:57'),
(77, 9, 'step1', 77, '2019-03-12 12:15:58', '2019-03-12 12:15:58', 'COMPLETED', 7, 6, 2, 4, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-12 12:15:58'),
(78, 9, 'step1', 78, '2019-03-12 12:48:26', '2019-03-12 12:48:26', 'COMPLETED', 7, 6, 2, 4, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-12 12:48:26'),
(79, 8, 'step1', 79, '2019-03-21 22:13:22', '2019-03-21 22:13:22', 'COMPLETED', 6, 5, 0, 5, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-21 22:13:22'),
(80, 2, 'step1', 80, '2019-03-21 23:13:27', '2019-03-21 23:13:27', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 1, 'FAILED', 'org.springframework.jdbc.UncategorizedSQLException: Attempt to process next row failed; uncategorized SQLException for SQL [SELECT a.ID_ALERTE, a.VILLE_DEPART, a.VILLE_ARRIVEE,u.EMAIL FROM ALERTE a,UTILISATEUR u WHERE u.ID_UTILISATEUR = a.ID_UTILISATEUR]; SQL state [S0022]; error code [0]; Column \'id\' not found.; nested exception is java.sql.SQLException: Column \'id\' not found.\r\n	at org.springframework.jdbc.support.AbstractFallbackSQLExceptionTranslator.translate(AbstractFallbackSQLExceptionTranslator.java:84)\r\n	at org.springframework.jdbc.support.AbstractFallbackSQLExceptionTranslator.translate(AbstractFallbackSQLExceptionTranslator.java:81)\r\n	at org.springframework.jdbc.support.AbstractFallbackSQLExceptionTranslator.translate(AbstractFallbackSQLExceptionTranslator.java:81)\r\n	at org.springframework.batch.item.database.AbstractCursorItemReader.doRead(AbstractCursorItemReader.java:456)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.read(AbstractItemCountingItemStreamItemReader.java:88)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.doRead(SimpleChunkProvider.java:91)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.read(SimpleChunkProvider.java:157)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider$1.doInIteration(SimpleChunkProvider.java:116)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.getNextResult(RepeatTemplate.java:374)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.executeInternal(RepeatTemplate.java:215)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.iterate(RepeatTemplate.java:144)\r\n	at org.springframework.batch.core.step.item.SimpleChunkProvider.provide(SimpleChunkProvider.java:110)\r\n	at org.springframework.batch.core.step.item.ChunkOrientedTasklet.execute(ChunkOrientedTasklet.java:69)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:406)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$ChunkTransactionCallback.doInTransaction(TaskletStep.java:330)\r\n	at org.springframework.transaction.support.TransactionTemplate.execute(TransactionTemplate.java:133)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep$2.doInChunkContext(TaskletStep.java:271)\r\n	at org.springframework.batch.core.scope.context.StepContextRepeatCallback.doInIteration(StepContextRepeatCallback.java:81)\r\n	at org.springframework.batch.repeat.support.RepeatTemplate.get', '2019-03-21 23:13:27'),
(81, 32, 'step1', 81, '2019-03-21 23:14:38', '2019-03-21 23:14:39', 'COMPLETED', 30, 29, 0, 29, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-21 23:14:39'),
(82, 6, 'step1', 82, '2019-03-23 22:43:20', '2019-03-23 22:43:21', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-23 22:43:21'),
(83, 6, 'step1', 83, '2019-03-24 12:06:41', '2019-03-24 12:06:41', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 12:06:41'),
(84, 6, 'step1', 84, '2019-03-24 12:06:42', '2019-03-24 12:06:42', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 12:06:42'),
(85, 6, 'step1', 85, '2019-03-24 12:10:20', '2019-03-24 12:10:21', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 12:10:21'),
(86, 6, 'step1', 86, '2019-03-24 12:10:21', '2019-03-24 12:10:21', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 12:10:21'),
(87, 6, 'step1', 87, '2019-03-24 12:12:49', '2019-03-24 12:12:49', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 12:12:49'),
(88, 6, 'step1', 88, '2019-03-24 13:05:30', '2019-03-24 13:05:31', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:05:31'),
(89, 6, 'step1', 89, '2019-03-24 13:05:31', '2019-03-24 13:05:31', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:05:31'),
(90, 6, 'step1', 90, '2019-03-24 13:11:45', '2019-03-24 13:11:45', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:11:45'),
(91, 6, 'step1', 91, '2019-03-24 13:12:15', '2019-03-24 13:12:15', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:12:15'),
(92, 6, 'step1', 92, '2019-03-24 13:14:51', '2019-03-24 13:14:51', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:14:51'),
(93, 6, 'step1', 93, '2019-03-24 13:15:47', '2019-03-24 13:15:47', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:15:47'),
(94, 6, 'step1', 94, '2019-03-24 13:16:04', '2019-03-24 13:16:05', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:16:05'),
(95, 6, 'step1', 95, '2019-03-24 13:16:12', '2019-03-24 13:16:12', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 13:16:12'),
(96, 6, 'step1', 96, '2019-03-24 14:28:47', '2019-03-24 14:28:47', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 14:28:47'),
(97, 6, 'step1', 97, '2019-03-24 14:29:44', '2019-03-24 14:29:44', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 14:29:44'),
(98, 6, 'step1', 98, '2019-03-24 15:25:37', '2019-03-24 15:25:37', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:25:37'),
(99, 6, 'step1', 99, '2019-03-24 15:44:08', '2019-03-24 15:44:09', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:44:09'),
(100, 6, 'step1', 100, '2019-03-24 15:45:14', '2019-03-24 15:45:14', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:45:14'),
(101, 6, 'step1', 101, '2019-03-24 15:50:09', '2019-03-24 15:50:09', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:50:09'),
(102, 6, 'step1', 102, '2019-03-24 15:51:23', '2019-03-24 15:51:23', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:51:23'),
(103, 6, 'step1', 103, '2019-03-24 15:53:43', '2019-03-24 15:53:43', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:53:43'),
(104, 6, 'step1', 104, '2019-03-24 15:55:50', '2019-03-24 15:55:51', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:55:51'),
(105, 6, 'step1', 105, '2019-03-24 15:56:21', '2019-03-24 15:56:22', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 15:56:22'),
(106, 6, 'step1', 106, '2019-03-24 16:00:18', '2019-03-24 16:00:19', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 16:00:19'),
(107, 6, 'step1', 107, '2019-03-24 16:02:52', '2019-03-24 16:02:53', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 16:02:53'),
(108, 6, 'step1', 108, '2019-03-24 16:04:27', '2019-03-24 16:04:28', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 16:04:28'),
(109, 6, 'step1', 109, '2019-03-24 16:06:04', '2019-03-24 16:06:05', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 16:06:05'),
(110, 2, 'step1', 110, '2019-03-24 16:12:02', '2019-03-24 16:12:02', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 0, 'FAILED', 'org.springframework.beans.factory.UnsatisfiedDependencyException: Error creating bean with name \'scopedTarget.createReaderBean\' defined in class path resource [eu/fr/indyli/formation/batch/ecolis/config/BatchAlerteXMLFileConfig.class]: Unsatisfied dependency expressed through method \'createReaderBean\' parameter 0; nested exception is org.springframework.beans.factory.BeanExpressionException: Expression parsing failed; nested exception is org.springframework.expression.spel.SpelEvaluationException: EL1021E: A problem occurred whilst attempting to access the property \'jobParameter\': \'Invalid property \'jobParameter\' of bean class [org.springframework.batch.core.scope.context.StepContext]: Bean property \'jobParameter\' is not readable or has an invalid getter method: Does the return type of the getter match the parameter type of the setter?\'\r\n	at org.springframework.beans.factory.support.ConstructorResolver.createArgumentArray(ConstructorResolver.java:749)\r\n	at org.springframework.beans.factory.support.ConstructorResolver.instantiateUsingFactoryMethod(ConstructorResolver.java:467)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.instantiateUsingFactoryMethod(AbstractAutowireCapableBeanFactory.java:1173)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.createBeanInstance(AbstractAutowireCapableBeanFactory.java:1067)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.doCreateBean(AbstractAutowireCapableBeanFactory.java:513)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.createBean(AbstractAutowireCapableBeanFactory.java:483)\r\n	at org.springframework.beans.factory.support.AbstractBeanFactory$2.getObject(AbstractBeanFactory.java:345)\r\n	at org.springframework.batch.core.scope.StepScope.get(StepScope.java:113)\r\n	at org.springframework.beans.factory.support.AbstractBeanFactory.doGetBean(AbstractBeanFactory.java:340)\r\n	at org.springframework.beans.factory.support.AbstractBeanFactory.getBean(AbstractBeanFactory.java:197)\r\n	at org.springframework.aop.target.SimpleBeanTargetSource.getTarget(SimpleBeanTargetSource.java:35)\r\n	at org.springframework.aop.framework.CglibAopProxy$DynamicAdvisedInterceptor.getTarget(CglibAopProxy.java:688)\r\n	at org.springframework.aop.framework.CglibAopProxy$DynamicAdvisedInterceptor.intercept(CglibAopProxy.java:638)\r\n	at eu.fr.indyli.formation.batch.ecolis.reader.AlerteXMLFileItemReader$$EnhancerBySpringCGLIB$$2110', '2019-03-24 16:12:02'),
(111, 6, 'step1', 111, '2019-03-24 16:13:13', '2019-03-24 16:13:14', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 16:13:14'),
(112, 6, 'step1', 112, '2019-03-24 16:16:30', '2019-03-24 16:16:30', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 16:16:30'),
(113, 6, 'step1', 113, '2019-03-24 17:35:56', '2019-03-24 17:35:56', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 17:35:56'),
(114, 2, 'step1', 114, '2019-03-24 17:47:33', '2019-03-24 17:47:33', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 0, 'FAILED', 'org.springframework.batch.item.ItemStreamException: Failed to initialize the reader\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader.open(AbstractItemCountingItemStreamItemReader.java:147)\r\n	at org.springframework.batch.item.support.AbstractItemCountingItemStreamItemReader$$FastClassBySpringCGLIB$$ebb633d0.invoke(<generated>)\r\n	at org.springframework.cglib.proxy.MethodProxy.invoke(MethodProxy.java:204)\r\n	at org.springframework.aop.framework.CglibAopProxy$CglibMethodInvocation.invokeJoinpoint(CglibAopProxy.java:721)\r\n	at org.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:157)\r\n	at org.springframework.aop.support.DelegatingIntroductionInterceptor.doProceed(DelegatingIntroductionInterceptor.java:133)\r\n	at org.springframework.aop.support.DelegatingIntroductionInterceptor.invoke(DelegatingIntroductionInterceptor.java:121)\r\n	at org.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:179)\r\n	at org.springframework.aop.framework.CglibAopProxy$DynamicAdvisedInterceptor.intercept(CglibAopProxy.java:656)\r\n	at eu.fr.indyli.formation.batch.ecolis.reader.AlerteXMLFileItemReader$$EnhancerBySpringCGLIB$$628efb11.open(<generated>)\r\n	at org.springframework.batch.item.support.CompositeItemStream.open(CompositeItemStream.java:96)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.open(TaskletStep.java:310)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:197)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at org.springframework.batch.core.job.flow.JobFlowExecutor.executeStep(JobFlowExecutor.java:64)\r\n	at org.springframework.batch.core.job.flow.support.state.StepState.handle(StepState.java:67)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.resume(SimpleFlow.java:169)\r\n	at org.springframework.batch.core.job.flow.support.SimpleFlow.start(SimpleFlow.java:144)\r\n	at org.springframework.batch.core.job.flow.FlowJob.doExecute(FlowJob.java:134)\r\n	at org.springframework.batch.core.job.AbstractJob.execute(AbstractJob.java:306)\r\n	at org.springframework.batch.core.launch.support.SimpleJobLauncher$1.run(SimpleJobLauncher.java:135)\r\n	at org.springframework.core.task.SyncTaskExecutor.execute(SyncTaskExecutor.java:50)\r\n	at org.springframework.batch.core.launch.support.SimpleJobLauncher.run(SimpleJobLauncher.java:128)\r\n	at sun.reflect.NativeMethodAccessorImpl', '2019-03-24 17:47:33'),
(115, 6, 'step1', 115, '2019-03-24 17:49:49', '2019-03-24 17:49:49', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-24 17:49:49'),
(116, 2, 'step1', 116, '2019-03-25 07:38:07', '2019-03-25 07:38:07', 'FAILED', 0, 0, 0, 0, 0, 0, 0, 0, 'FAILED', 'org.springframework.beans.factory.BeanCreationException: Error creating bean with name \'scopedTarget.createReaderBean\' defined in class path resource [eu/fr/indyli/formation/batch/ecolis/config/BatchAlerteXMLFileConfig.class]: Bean instantiation via factory method failed; nested exception is org.springframework.beans.BeanInstantiationException: Failed to instantiate [eu.fr.indyli.formation.batch.ecolis.reader.AlerteXMLFileItemReader]: Factory method \'createReaderBean\' threw exception; nested exception is java.lang.IllegalArgumentException: Path must not be null\r\n	at org.springframework.beans.factory.support.ConstructorResolver.instantiateUsingFactoryMethod(ConstructorResolver.java:599)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.instantiateUsingFactoryMethod(AbstractAutowireCapableBeanFactory.java:1173)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.createBeanInstance(AbstractAutowireCapableBeanFactory.java:1067)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.doCreateBean(AbstractAutowireCapableBeanFactory.java:513)\r\n	at org.springframework.beans.factory.support.AbstractAutowireCapableBeanFactory.createBean(AbstractAutowireCapableBeanFactory.java:483)\r\n	at org.springframework.beans.factory.support.AbstractBeanFactory$2.getObject(AbstractBeanFactory.java:345)\r\n	at org.springframework.batch.core.scope.StepScope.get(StepScope.java:113)\r\n	at org.springframework.beans.factory.support.AbstractBeanFactory.doGetBean(AbstractBeanFactory.java:340)\r\n	at org.springframework.beans.factory.support.AbstractBeanFactory.getBean(AbstractBeanFactory.java:197)\r\n	at org.springframework.aop.target.SimpleBeanTargetSource.getTarget(SimpleBeanTargetSource.java:35)\r\n	at org.springframework.aop.framework.CglibAopProxy$DynamicAdvisedInterceptor.getTarget(CglibAopProxy.java:688)\r\n	at org.springframework.aop.framework.CglibAopProxy$DynamicAdvisedInterceptor.intercept(CglibAopProxy.java:638)\r\n	at eu.fr.indyli.formation.batch.ecolis.reader.AlerteXMLFileItemReader$$EnhancerBySpringCGLIB$$70fb4328.open(<generated>)\r\n	at org.springframework.batch.item.support.CompositeItemStream.open(CompositeItemStream.java:96)\r\n	at org.springframework.batch.core.step.tasklet.TaskletStep.open(TaskletStep.java:310)\r\n	at org.springframework.batch.core.step.AbstractStep.execute(AbstractStep.java:197)\r\n	at org.springframework.batch.core.job.SimpleStepHandler.handleStep(SimpleStepHandler.java:148)\r\n	at or', '2019-03-25 07:38:07'),
(117, 6, 'step1', 117, '2019-03-25 07:51:29', '2019-03-25 07:51:30', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-25 07:51:30'),
(118, 6, 'step1', 118, '2019-03-25 07:53:42', '2019-03-25 07:53:43', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-25 07:53:43'),
(119, 6, 'step1', 119, '2019-03-25 07:54:16', '2019-03-25 07:54:17', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-25 07:54:17'),
(120, 6, 'step1', 120, '2019-03-25 21:57:06', '2019-03-25 21:57:06', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-25 21:57:06'),
(121, 6, 'step1', 121, '2019-03-25 22:04:24', '2019-03-25 22:04:24', 'COMPLETED', 4, 3, 0, 3, 0, 0, 0, 0, 'COMPLETED', '', '2019-03-25 22:04:24');

-- --------------------------------------------------------

--
-- Structure de la table `batch_step_execution_context`
--

DROP TABLE IF EXISTS `batch_step_execution_context`;
CREATE TABLE IF NOT EXISTS `batch_step_execution_context` (
  `STEP_EXECUTION_ID` bigint(20) NOT NULL,
  `SHORT_CONTEXT` varchar(2500) NOT NULL,
  `SERIALIZED_CONTEXT` text,
  PRIMARY KEY (`STEP_EXECUTION_ID`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_step_execution_context`
--

INSERT INTO `batch_step_execution_context` (`STEP_EXECUTION_ID`, `SHORT_CONTEXT`, `SERIALIZED_CONTEXT`) VALUES
(1, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(2, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(3, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(4, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(5, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(6, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(7, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(8, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(9, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(10, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(11, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(12, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(13, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(14, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":1},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(15, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":1},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(16, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":1},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(17, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(18, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(19, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(20, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(21, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(22, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(23, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(24, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(25, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":3},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(26, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(27, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(28, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(29, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(30, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(31, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(32, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(33, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(34, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(35, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(36, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(37, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(38, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(39, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(40, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(41, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(42, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(43, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(44, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":2},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(45, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(46, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":1},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(47, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(48, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(49, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(50, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(51, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(52, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(53, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(54, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(55, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(56, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(57, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(58, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":2},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(59, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(60, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":2},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(61, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(62, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":2},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(63, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(64, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(65, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(66, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(67, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(68, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(69, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(70, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(71, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(72, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(73, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":5},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(74, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(75, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":0},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(76, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(77, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":7},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(78, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":7},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(79, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"FlatFileItemReader.read.count\",\"int\":6},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(80, '{\"map\":[{\"entry\":[{\"string\":\"JdbcCursorItemReader.read.count\",\"int\":0},{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(81, '{\"map\":[{\"entry\":[{\"string\":\"JdbcCursorItemReader.read.count\",\"int\":30},{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(82, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(83, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(84, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(85, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(86, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(87, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(88, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(89, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(90, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(91, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(92, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(93, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(94, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(95, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(96, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(97, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(98, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(99, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(100, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(101, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(102, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(103, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(104, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(105, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(106, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(107, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(108, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(109, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(110, '{\"map\":[\"\"]}', NULL),
(111, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(112, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(113, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(114, '{\"map\":[\"\"]}', NULL),
(115, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(116, '{\"map\":[\"\"]}', NULL),
(117, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(118, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(119, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(120, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL),
(121, '{\"map\":[{\"entry\":[{\"string\":[\"batch.taskletType\",\"org.springframework.batch.core.step.item.ChunkOrientedTasklet\"]},{\"string\":\"StaxEventItemReader.read.count\",\"int\":4},{\"string\":[\"batch.stepType\",\"org.springframework.batch.core.step.tasklet.TaskletStep\"]}]}]}', NULL);

-- --------------------------------------------------------

--
-- Structure de la table `batch_step_execution_seq`
--

DROP TABLE IF EXISTS `batch_step_execution_seq`;
CREATE TABLE IF NOT EXISTS `batch_step_execution_seq` (
  `ID` bigint(20) NOT NULL,
  `UNIQUE_KEY` char(1) NOT NULL,
  UNIQUE KEY `UNIQUE_KEY_UN` (`UNIQUE_KEY`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Déchargement des données de la table `batch_step_execution_seq`
--

INSERT INTO `batch_step_execution_seq` (`ID`, `UNIQUE_KEY`) VALUES
(121, '0');

-- --------------------------------------------------------

--
-- Structure de la table `comment`
--

DROP TABLE IF EXISTS `comment`;
CREATE TABLE IF NOT EXISTS `comment` (
  `id_comment` int(11) NOT NULL AUTO_INCREMENT,
  `id_utilisateur` int(11) NOT NULL,
  `corps` text COLLATE utf8_unicode_ci,
  `date_creation` datetime NOT NULL,
  PRIMARY KEY (`id_comment`),
  KEY `FK_USER_DEPOSE_COMMENT` (`id_utilisateur`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `comment`
--

INSERT INTO `comment` (`id_comment`, `id_utilisateur`, `corps`, `date_creation`) VALUES
(5, 6, 'Pourrais je avoir plus de détails sur l\'offre svp ?', '2015-07-29 15:23:22'),
(6, 2, 'Transporteur tres ponctuel', '2016-01-12 23:04:45'),
(7, 2, 'Transporteur semi ponctuel', '2016-01-12 23:05:16');

-- --------------------------------------------------------

--
-- Structure de la table `image`
--

DROP TABLE IF EXISTS `image`;
CREATE TABLE IF NOT EXISTS `image` (
  `id_image` int(11) NOT NULL AUTO_INCREMENT,
  `id_utilisateur` int(11) NOT NULL,
  `chemin` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `date_creation` datetime DEFAULT NULL,
  PRIMARY KEY (`id_image`),
  KEY `FK_USER_DEPOSE_IMAGE` (`id_utilisateur`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `image`
--

INSERT INTO `image` (`id_image`, `id_utilisateur`, `chemin`, `date_creation`) VALUES
(4, 6, 'f787250fe425379056128efd746af51c2a8021d2.jpeg', NULL);

-- --------------------------------------------------------

--
-- Structure de la table `message`
--

DROP TABLE IF EXISTS `message`;
CREATE TABLE IF NOT EXISTS `message` (
  `id_message` int(11) NOT NULL AUTO_INCREMENT,
  `id_utilisateur` int(11) DEFAULT NULL,
  `id_annonce` int(11) NOT NULL,
  `corps` text COLLATE utf8_unicode_ci,
  `date_creation` datetime NOT NULL,
  PRIMARY KEY (`id_message`),
  KEY `FK_ANNONCE_POSE_MESSAGE` (`id_annonce`),
  KEY `FK_USER_DEPOSE_MESSAGE` (`id_utilisateur`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `message`
--

INSERT INTO `message` (`id_message`, `id_utilisateur`, `id_annonce`, `corps`, `date_creation`) VALUES
(2, 6, 2, 'dhfhdhdhfdhd', '2015-07-05 08:33:09');

-- --------------------------------------------------------

--
-- Structure de la table `utilisateur`
--

DROP TABLE IF EXISTS `utilisateur`;
CREATE TABLE IF NOT EXISTS `utilisateur` (
  `id_utilisateur` int(11) NOT NULL AUTO_INCREMENT,
  `civilite` varchar(2) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `login` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `enabled` tinyint(4) NOT NULL,
  `derniere_connexion` datetime DEFAULT NULL,
  `annee_de_naissance` int(11) NOT NULL,
  `telephone` varchar(30) COLLATE utf8_unicode_ci DEFAULT NULL,
  `date_inscription` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'Date d''inscription au syst?me',
  PRIMARY KEY (`id_utilisateur`),
  UNIQUE KEY `UNIQ_8D93D649A0D96FBF` (`email`),
  KEY `UNIQ_8D93D64992FC23A8` (`login`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Déchargement des données de la table `utilisateur`
--

INSERT INTO `utilisateur` (`id_utilisateur`, `civilite`, `name`, `login`, `password`, `email`, `enabled`, `derniere_connexion`, `annee_de_naissance`, `telephone`, `date_inscription`) VALUES
(2, '1', 'Le Guene', 'ppa23', '$2a$10$mXXjgcXzUwHOd3BwbJjMCuXuoubrYaDXPD7ZU3N0WQHcZJfOvOm5a', 'paule@paule.com', 1, '2015-07-04 09:03:23', 1989, '0761705745', '2017-06-28 17:51:46'),
(3, '2', 'Le Maire', 'jje', '$2a$10$G2suwId97MjxYDbH7282reau0TPh9nyxAvoYBexyxNBQZkFS4PiQi', 'jean@jean.com', 1, '2015-07-01 12:54:18', 1994, NULL, '2017-06-28 17:52:01'),
(5, '2', 'Marteau', 'mto', '$2a$10$VuGWs6Kh6Yio2U3kyz6XcO0spIo/dFoU8Q178ewRXxgl/vwTAz5Ya', 'moi@moi.com', 1, '2015-07-04 09:47:30', 1992, '09890987', '2017-06-28 17:51:28'),
(6, '1', 'ZOME', 'czo', '$2a$10$UiyBHx.zxcwEvKcII0rDyOK2AroUZCc1U4do9pjc28zd6uGo3NJv.', 'czome@yahoo.fr', 1, '2015-07-29 15:57:41', 1997, '0624623647', '2017-06-28 17:51:20'),
(39, '1', 'MACRON', 'ema', '$2a$10$7nuXRVVVPpEmrI3xpZEfUeLgLrxjswzhuSyQsGA7wC3vK/R6hcEIy', 'emmanuel.macron@gouv.fr', 1, '2017-06-28 15:57:41', 1977, '0640789087', '2017-06-25 17:46:24'),
(47, '1', 'pourSuppREST', 'ASupp', '$2a$10$vkvtv3ijEiip8v3MeeRzhu7ru0kPjoTG5ppIX8B1YI86pc4p4RwFW', 'peter.spin...@gmail.com', 0, NULL, 2000, '0989876545', '2018-08-26 18:11:18'),
(48, '1', 'Ngatat', 'nga', '$2a$10$SMj7p4xCFE4bpSiA/HogHeTu1HBcSju0XO6B7oUkxwwkQaVkdn2AO', 'ngatateyahoo.fr', 0, NULL, 0, '09090909', '2018-12-14 20:07:48'),
(49, '1', 'Guehep', 'Toto', '$2a$10$jx4lYjQfYHAtBHIaq7il3Op0AD9SUgvJ37DDT/KNStEGLiw/jaPIy', 'gehe@alceane.fr', 0, NULL, 0, 'Bdbdb', '2018-12-16 14:50:46'),
(50, '1', 'TCHOFFO', 'Merlin', '$2a$10$0GoNCYJQpyd2l10bEDK5Muw8moL6An3uUImnY4D5LTfYZIGLMAbka', 'ntchoffo@kereval.fr', 0, NULL, 0, '03456667', '2018-12-16 14:51:20'),
(51, '1', 'Mbougueung', 'amb', '$2a$10$TcU9.TuplJbEKIAliPVPnuEYJF44IVLDCbNbjH/cjkZrT821.3xIq', 'sima@yahoo.fr', 0, NULL, 0, 'Tuu', '2018-12-16 14:52:08'),
(52, '1', 'Tchakounang', 'tcha', '$2a$10$l9kjwblD3PVIt0QU8jzmTea1XdlKneAD1RO1PK6AbSUEMqt1MozHO', 'tdaniel@google.fr', 0, NULL, 0, '123', '2018-12-16 14:52:41'),
(55, '1', 'Boukebeche', 'madani', '$2a$10$wsclReMgGBtCAGCJjdJILuY0B4f3/XLo61L89rFY2VRZEq1t9Un1q', 'madani.boukeche@esic.fr', 1, NULL, 1975, '098987656', '2018-12-16 15:10:15'),
(56, '1', 'ESSOLA', 'esso', '$2a$10$4q3segzzcnDsiHU6sKNEludyJ0KKqRDUqTVE.epYhxmhG2/aMUtea', 'esso@vinci-energies.com', 1, NULL, 1980, '08987678', '2019-03-07 01:22:14');

--
-- Contraintes pour les tables déchargées
--

--
-- Contraintes pour la table `alerte`
--
ALTER TABLE `alerte`
  ADD CONSTRAINT `FK_USER_DEPOSE_ALERTE` FOREIGN KEY (`id_utilisateur`) REFERENCES `utilisateur` (`id_utilisateur`) ON DELETE CASCADE;

--
-- Contraintes pour la table `annonce`
--
ALTER TABLE `annonce`
  ADD CONSTRAINT `FK_USER_DEPOSE_ANNONCE` FOREIGN KEY (`id_utilisateur`) REFERENCES `utilisateur` (`id_utilisateur`) ON DELETE CASCADE;

--
-- Contraintes pour la table `batch_job_execution`
--
ALTER TABLE `batch_job_execution`
  ADD CONSTRAINT `JOB_INST_EXEC_FK` FOREIGN KEY (`JOB_INSTANCE_ID`) REFERENCES `batch_job_instance` (`JOB_INSTANCE_ID`);

--
-- Contraintes pour la table `batch_job_execution_context`
--
ALTER TABLE `batch_job_execution_context`
  ADD CONSTRAINT `JOB_EXEC_CTX_FK` FOREIGN KEY (`JOB_EXECUTION_ID`) REFERENCES `batch_job_execution` (`JOB_EXECUTION_ID`);

--
-- Contraintes pour la table `batch_job_execution_params`
--
ALTER TABLE `batch_job_execution_params`
  ADD CONSTRAINT `JOB_EXEC_PARAMS_FK` FOREIGN KEY (`JOB_EXECUTION_ID`) REFERENCES `batch_job_execution` (`JOB_EXECUTION_ID`);

--
-- Contraintes pour la table `batch_step_execution`
--
ALTER TABLE `batch_step_execution`
  ADD CONSTRAINT `JOB_EXEC_STEP_FK` FOREIGN KEY (`JOB_EXECUTION_ID`) REFERENCES `batch_job_execution` (`JOB_EXECUTION_ID`);

--
-- Contraintes pour la table `batch_step_execution_context`
--
ALTER TABLE `batch_step_execution_context`
  ADD CONSTRAINT `STEP_EXEC_CTX_FK` FOREIGN KEY (`STEP_EXECUTION_ID`) REFERENCES `batch_step_execution` (`STEP_EXECUTION_ID`);

--
-- Contraintes pour la table `comment`
--
ALTER TABLE `comment`
  ADD CONSTRAINT `FK_USER_DEPOSE_COMMENT` FOREIGN KEY (`id_utilisateur`) REFERENCES `utilisateur` (`id_utilisateur`) ON DELETE CASCADE;

--
-- Contraintes pour la table `image`
--
ALTER TABLE `image`
  ADD CONSTRAINT `FK_USER_DEPOSE_IMAGE` FOREIGN KEY (`id_utilisateur`) REFERENCES `utilisateur` (`id_utilisateur`) ON DELETE CASCADE;

--
-- Contraintes pour la table `message`
--
ALTER TABLE `message`
  ADD CONSTRAINT `FK_ANNONCE_POSE_MESSAGE` FOREIGN KEY (`id_annonce`) REFERENCES `annonce` (`id_annonce`) ON DELETE CASCADE,
  ADD CONSTRAINT `FK_USER_DEPOSE_MESSAGE` FOREIGN KEY (`id_utilisateur`) REFERENCES `utilisateur` (`id_utilisateur`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
